{
    "bitcoin": {
        "is_stock": false,
        "submissions": [
            {
                "created_utc": 1614373174.0,
                "num_comments": 1778,
                "permalink": "/r/investing/comments/lt7oop/jpmorgan_advises_clients_to_expose_1_of_their/",
                "score": 4568,
                "selftext": "In a recent note to clients, strategists from JPMorgan (NYSE:JPM) suggested a one percent portfolio allocation to Bitcoin and other cryptocurrencies.\n\nAs reported by Bloomberg, JPM strategists Joyce Chang and Amy Ho opined that Bitcoin could serve as a hedge against fluctuations from traditional assets like bonds, stocks, and commodities. However, they advised clients to allocate a small percentage due to the risk of major downturns in Bitcoin’s value.\n\nAfter setting a new all-time high above $58,000, the value of the digital asset slumped to less than $45,000 and has been struggling to recover ever since.\n\nChang and Ho told investors:\n\n>*In a multi-asset portfolio, investors can likely add up to 1% of their allocation to cryptocurrencies in order to achieve any efficiency gain in the overall risk-adjusted returns of the portfolio.*\n\nBitcoin has welcomed major investments from the likes of Paul Tudor Jones, Tesla (NASDAQ:TSLA), and MicroStrategy. The endorsement from JPM comes at a time when institutional players are rushing to accumulate the digital asset. As per Bloomberg’s report, America’s oldest bank BNY Mellon (NYSE:BK) has also announced plans to enable Bitcoin transactions for its clients.\n\nThe strategists were quick to add that cryptocurrencies should be viewed as an investment vehicle and opposed to being funding currencies like the USD or EUR. This appears to be contrary to earlier statements from other JPM analysts that called cryptocurrencies the “poorest hedge for major drawdowns in equities.”\n\n[https://www.investing.com/news/cryptocurrency-news/jpmorgan-advises-clients-to-expose-1-of-their-portfolio-to-bitcoin-2431724](https://www.investing.com/news/cryptocurrency-news/jpmorgan-advises-clients-to-expose-1-of-their-portfolio-to-bitcoin-2431724)",
                "title": "JPMorgan advises clients to expose 1% of their portfolio to Bitcoin"
            },
            {
                "created_utc": 1614478686.0,
                "num_comments": 898,
                "permalink": "/r/investing/comments/lu32qs/why_ive_changed_my_opinion_on_bitcoin/",
                "score": 1177,
                "selftext": "I've recently changed my opinion on Bitcoin from being super bullish to thinking that it's an incredibly risky asset that is completely unpredictable. First, a quick backstory. I first bought into Bitcoin in December 2017 at literally the absolute top. I bought in at around $19,000. I shortly sold after for a small loss and I never touched Bitcoin for over a year. Starting in 2019, I started to get kind of interested in Bitcoin again. I was interested in the actual technology though and not simply the price. I bought in in July 2019 at around $11,000. I had in making purchases here and there and I even bought in at around $5,000 at around March 2020. I was buying more aggressively towards the end of the year and I think my average cost was in the low $20,000's. I've recently sold almost all of my bitcoin for around $46,000. I only have a very small amount now as pure speculation. I want to list all the points made by those in favor of Bitcoin that even I used to make myself. I then want to list my new perspective on them and why I don't think they are valid. Here goes.\n\n&#x200B;\n\n# Medium of Exchange\n\nThis was supposed to be the original purpose of Bitcoin. It was supposed to be a peer to peer payment system that didn't need a central authority to function. Maybe Bitcoin was a decent payment system back in the days when it was used on places like the silk road, places where it is not reliable to use a centralized payment system, but it fails as a payment system in the real world for multiple reasons.\n\n1. Bitcoin has exorbitantly high fees. If you want your transaction to occur within the next block, you're gonna be paying over $10 in fees minimum. If you pay a fee of $1, you're still gonna be waiting at least a few hours for it to confirm. This is completely impractical for being used in the real economy.\n2. Bitcoin cannot scale. Bitcoin can only do about 4 transactions per second whereas Visa can do over 65,000. There is no way for Bitcoin to settle transactions on a global scale with how slow it is. And if more people did start to use Bitcoin, the fees would become even more expensive which relates to my first point.\n3. Bitcoin offers no benefit as a medium of exchange to the average person than something like credit cards or apps like PayPal, Cash App, or Venmo. In fact Bitcoin is worse than these apps for the average person. These apps allow you to send money instantly and for free while with Bitcoin you'll be waiting possibly hours to send money and you'll pay at least a few dollars. Nobody wants to pay a few dollars to send $20 to a friend to pay them for something.\n4. Bitcoin is way too volatile to be used as a medium of exchange. In order for something to successfully work as money in the economy, it needs to be stable. If money does not have a stable price, it will result in all kinds of misallocations of capital in the economy. Borrowing and lending both get screwed up and companies cannot reliably make long term plans if the value of the currency drops by 50% in a year. I actually favor the privatization of money and I want people to be able to use whatever money that they want. I just don't think Bitcoin works. Personally, I think David Friedman's idea is best. That is that money should be backed by a basket of commodities in the economy to ensure stable prices. Backing money by a single commodity like gold runs into issues because if that commodity becomes high in demand, it will increase the value of the money without any sort of productivity increase. Backing it by a bunch of commodities is basically the same as diversifying your stock portfolio. It would make it more stable. Anyways that's a whole different discussion so I don't wanna get deep into it.\n\n&#x200B;\n\n# Store of Value\n\nBecause Bitcoin obviously fails as a medium of exchange, its proponents have changed to calling it a store of value. I don't see Bitcoin as being an effective store of value for a few reasons.\n\n1. Bitcoin has had 3 drawdowns of over 80% in its lifetime. Something that drops 80% because of no real catalyst is not an effective store of value.\n2. Proponents will say \"But in all its 12 years it has always gone higher so that proves it's a good store of value.\" That doesn't make it a store of value though as it has clearly lost a lot of its value 3 times. Store of values are places where people put their money when they know it'll be there if some event happens. If someone bought Bitcoin and it drops 50%, you can't just tell them to hold till it goes back up because that's not what a store of value asset is supposed to be.\n3. Bitcoiners themselves don't even believe that it is an effective store of value. Why would they say \"don't invest more than you can afford to lose\" if it was an effective store of value?\n4. If Bitcoin was an actual store of value asset, nobody would want it. If Bitcoin simply went up 2-3% to account for inflation, nobody would want to buy it. Everyone is in Bitcoin because they wanna become rich. Nobody actually cares about any of technology or use.\n5. Bitcoin has no value. \n\n* Bitcoin is backed by nothing. People will say that the dollar is backed by nothing but that's simply not true. The dollar is backed by the power of the US government and it's also backed by the productivity of the US economy. \n* Gold and other commodities have value because they are used in the real world for real uses. We can actually create a demand curve for gold. It's impossible to create a demand curve for Bitcoin because most Bitcoin believers are willing to buy at any price. The demand curve for Bitcoin is vertical.\n* Bitcoin is worth what 2 people believe it's worth. Now you can say that about anything but because its only utility is being able to transact, it's relevant in how you value it. The value of Bitcoin is the same whether it's worth $1 or $1,000,000 because it doesn't produce anything. So why should it ever be worth $1,000,000?\n* The fact that Bitcoin is scarce doesn't actually mean anything because since there is no way to effectively measure the demand of Bitcoin, its supply doesn't matter either. Nobody is looking to buy a certain number of Bitcoin. People are buying a certain dollar amount. So the actual units that exist of Bitcoin is irrelevant because nobody is trying to accumulate a certain number of Bitcoin.\n* What is the difference between 1 Bitcoin and 0.1 Bitcoin? In absence of the price, 1 Bitcoin is no more valuable than 0.1 Bitcoin. 0.1 Bitcoin is more valuable than 1 Bitcoin was back in March. 100 oz of gold is 10 times more stuff than 10 oz of gold. 100 oz of gold took more effort to create than 10 oz of gold. There is no actual utility in Bitcoin besides the ability to send it to someone. How much should that be worth? It should probably be worth at least something but it's impossible to know. Is Bitcoin undervalued at $50,000? Is it undervalued at $100,000? $1,000,000? It's impossible to know because it has no fundamental value.\n\n&#x200B;\n\nBitcoin is only worth $50,000 a coin because someone bought it thinking they could sell it to someone else for more. It is the Greater Fool Theory. Nobody actually wants Bitcoin. People want dollars to buy stuff and they think Bitcoin will allow them to get more dollars. Other people believe the same thing so they are willing to buy it for higher because they think they can sell it for higher. I'm not even saying that Bitcoin will go down. I think in 10 years it is likely that Bitcoin could 10x from here. That doesn't mean that Bitcoin will actually be anymore valuable than it is today. It will be worth $500,000 because someone believed that they could sell it to someone else for more than $500,000. If Apple increases net income by 5% in a quarter, it would be justified for their stock to be valued higher because they have created more value. What value has Bitcoin ever created or will ever create that can ever justify its price? I'd be curious to hear a rebuttal to my arguments besides just \"you don't understand it\" because I've held Bitcoin for almost 2 years through the ups and the downs. I've only now changed my opinion on it. Hopefully we can have a civil discussion about it.",
                "title": "Why I've changed my opinion on Bitcoin."
            },
            {
                "created_utc": 1614030124.0,
                "num_comments": 43,
                "permalink": "/r/stocks/comments/lq0slw/here_is_a_market_recap_for_today_monday_february/",
                "score": 178,
                "selftext": " \n\n**PsychoMarket Recap - Monday, February 22, 2021**\n\nStocks finished mixed as rising Treasury yields and expectations of higher inflation weighed on equity prices. The Dow Jones (DIA) closed the day modestly green while the S&P 500 (SPY) and the Nasdaq (QQQ) pulled back steeply. The tech-heavy Nasdaq posted its worst performance in more than a month.\n\nProspects of rising inflation following the coronavirus pandemic have pushed bond prices lower while pushing Treasury yields sharply higher. .The yield on the benchmark 10-year Treasury note briefly ticked above 1.39% on Monday to reach a fresh one-year high. Higher Treasury yields lead banks to place higher on loans in order to offset the effect of inflation. With so much money being pumped into the economy this year, many analysts have warned about rising inflation rates in the post-pandemic economy. However, despite the abrupt spike, Treasury yields remain at historically low levels. Now is not the time to panic, several fundamental factors, such as favorable fiscal and monetary policy and growing corporate earnings, remain in place to support a post-pandemic bull market. Below is a chart of the 10-year Treasury Yield rate made by Bloomberg📷\n\nThe COVID-19 vaccine rollout in the U.S. has so far seen just under 64.2 million doses administered to Americans as of Monday morning, according to an update from the Centers for Disease Control and Prevention. Additionally, 75.3 million doses have so far been delivered to states, inclusive of both Moderna's and Pfizer's and BioNTech's vaccines. Last week, the United States averaged 77,665 new coronavirus cases per day, a drop of 43% from the average of two weeks ago according to data analyzed by the New York Times. The drop in cases is staggering given that on January 8, the US recorded more than 300,000 new cases. \n\n**Highlights**\n\n* A lot of popular EV stocks like Tesla (TSLA), Nio (NIO), Plug Power (PLUG) and many others have been pulling back sharply in recent days. Remember Psychos, many of these stocks were overvalued 1-2 weeks ago, pullbacks like this represent an opportunity.\n* After reaching an impressive high of $58,000, Bitcoin (BTC) pulled back around 10% today.\n* The dollar slid against major currencies, slumping to multi-year lows against the British pound and the Australian dollar, another sign of rising fears of inflation\n* Australia will not alter legislation that would make Facebook and Alphabet Inc's Google pay news outlets for content, a senior lawmaker said on Monday, as Canberra neared a final vote on whether to pass the bill into law. Remember, as of now, Facebook (FB) is not showing any news to its users in Australia.\n* China’s bank regulator on Saturday tightened requirements on the internet loan business of commercial banks, amid heightened scrutiny of online lending by internet giants such as Ant Group, the finance arm of Alibaba Group.\n* Albermarle (ALB) target raised by Argus from $140 to $177 at Buy. Stock currently around $156. We like this stock, one of the largest publicly traded lithium miners.\n* Baidu (BIDU) target raised by Barclays from $350 to $400 at Overweight. Stock currently around $340\n* Crowdstrike (CRWD) target raised by JMP Securities from $180 to $295 at Outperform. Stock currently around $240\n* Evolus (EOLS) target raised by Cantor Fitzgerald from $11 to $20 at Overweight.\n* EPAM Systems (EPAM) target raised by Barclays from $377 to $450 at Overweight. Stock currently around $376\n* Overstock (OSTK) target raised by Needham & Co. from $98 to $110 at Buy. Stock currently around $101. \n* Pure Storage (PSTG) target raised by JMP Securities from $26 to $35 at Outperform. Stock currently around $27\n* United Therapeutics (UTHR) target raised by Credit Suisse from $169 to $196 at Outperform. Stock currently around $175\n* Zscaler (ZS) target raised by Royal Bank of Canada from $205 to $240 at Outperform. Stock currently around $226\n\n“Life can only be understood backwards; but it must be lived forwards.” — Søren Kierkegaard.",
                "title": "Here is a Market Recap for today Monday, February 22, 2021. Please enjoy!"
            },
            {
                "created_utc": 1614116632.0,
                "num_comments": 118,
                "permalink": "/r/investing/comments/lqtwws/square_4th_quarter_earnings/",
                "score": 171,
                "selftext": "Square [$SQ](https://twitter.com/search?q=%24SQ&src=cashtag_click) Q4 2020 Earnings Thread\n\nRevenue: $3.16 billion +141% YoY\n\nEPS $0.32 vs $0.24 expected\n\nGross Profit: $804 million +52% YoY\n\nNet Income: $294 million vs $391 million YoY\n\nCash App Monthly Active Users: 36 million +50% YoY\n\nCash App Gross Profit: $377 million +162% YoY\n\nDon't own Square.  But would like to be invested in fintech.  Between Sq and Paypal was always more interested in Sq.  With the drop is now a good time to buy and hold?  Or is the valuation still too rich?  Numbers look solid imo.  The bitcoin purchase of 170 million doesn't seem that much in the grand scheme of things.\n\nI'm Canadian and don't use cashapp or the Paypal version so ppl who use it and their opinions would be nice as well.  Or any other recommendations in the fintech space.  ",
                "title": "Square 4th quarter earnings"
            },
            {
                "created_utc": 1613962527.0,
                "num_comments": 25,
                "permalink": "/r/stocks/comments/lpdeem/understanding_fintech_an_essay_on_my_investment/",
                "score": 118,
                "selftext": "## Purpose\n\nThe purpose of this post is to write out the thought process and analysis of some of my major investments. Each of these investments can take over a year to decide on, but cannot be invested in until I have written out the process.\n\nPart of this is also due to the fact that I believe that investing in securities will become increasingly complex yet accessible for a typical retail investor which will either result in isolation OR incentivize cooperation to open-source complex information.\n\n- Does the average retail investor really understand the core regulatory influences in investments like Square, PayPal, or even RH? \n\n- Does the average retail investor understand incentives vs. bias?\n\n- Is the average retail investor familiar with fashion trends that make Nike and Foot Locker valuable?\n\n- Is an average retail investor familiar with competitive types of manufacturing processes when they invest in technologies like AMD or GE? \n\n- Is the average retail investor familiar with the network models that govern software like Fastly and Twilio?\n\nAt the end of the day, I am an educator and I believe that the goal of education is to engage a reader into a deeper curiosity or discussion, so that’s why I’m sharing my writing. I’m not here to convince you that this stock is even a good choice - but to explore the economics behind it.\n\n\n## The Fundamental Constraint\n\nThis one is not going to be easy to understand, so get your coffee ready and get comfortable. It’s going to be difficult to digest the technology behind Square because it asks you to believe the premise that banking is going to change in unforeseeable ways in the near future. I currently work in the Banking-as-a-Service sector as an engineer, so I have some insight that I could offer.\n\nA fair amount of people may not know this, but organizations like Stripe, Square, PayPal, and other fintech infrastructures are just network layers over existing banks. For example, Stripe partners with Evolve Bank while Square partners with Sutton Bank. This is a win-win scenario, for now, where banks get to see the benefits of technology distribution powers, while tech companies gain a shortcut to regulatory requirements.\n\nIt may help to accept this by understanding the idea that drives the financial technology sector. In order to distribute financial services to people, regardless of net worth, trustworthiness and accountability must be established. These are regulatory frameworks developed by the Bank Secrecy Act (BSA) or Financial Crimes Enforcement Network (FinCEN) that are also challenged by such technologies like B*tcoin, where validation is arbitrary and based on fingerprinting. This trustworthiness is also the reason why you’re able to instantly invest in your RH account - you are a trusted user and there is no reason to believe that you are somebody else.\n\nIt is, then, no secret as to why Square invested in B*tcoin. There are other reasons, even cultural, as to why they did, but the basic root behind the decision is that it allows research into new verification methods that makes shipping financial services even more frictionless. It is a potential vector for changing the rules of the game and leveling the playing field, so to speak. Being a software-first bank allows you to distribute at a much more rapid pace than a traditional large bank.\n\nIn short, The fuel of fintech is the underbanked. The combustion engine that burns it is cybersecurity and AI to validate that a user is trustworthy each time they commit a transaction. This is known as the KYC Problem and how each organization approaches the regulatory requirement to verify that a user is not committing fraud will determine the outcome of who dominates the fintech sector. This is also why you see customer-service as a pervasive problem.\n\nNow let me just go ahead and take the opinion here - I don’t think PayPal will achieve this in the US, but their investment in MercadoLibre might take them there in some way. Latin America is a particularly interesting case study in underbanking. The reason I hate this is because I feel that a lot of their services are disconnected and low-quality. For example, Remitly allows me to send money to Mexico in a highly informed and smooth way, while Xoom (a paypal remittance service) just about shits the bed the moment I touch it. Sure, that’s anecdote - but I want my investments going somewhere where the design is ALWAYS built around the customer. PayPal’s management resulting in the shipment of an unfinished and thoughtless product is just an awful red flag to me. I should not be getting unknown error alert when I send money to another country. \n\n\n# The Underbanked\n\nJack Dorsey is an interesting character, who views on technology can be highlighted:\n\n&gt; “...to develop an open and decentralized standard for social media. The goal is for Twitter to ultimately be a client of this standard. Twitter was so open early on that many saw its potential to be a decentralized internet standard, like SMTP (email protocol). For a variety of reasons, all reasonable at the time, we took a different path and increasingly centralized Twitter. But a lot’s changed over the years.”\n\nInterestingly enough, Twitter is used in such a manner. The Tweet system these days gets shared across all social media platforms due to its simple design and even appears interactively during sporting events or billboards.\n\nIn my view, Jack Dorsey sees the current period of time as a turning point in internet communications and the underbanked. It is clear as day in its marketing strategy, where Square seller services is marketed strongly toward immigrants and first-time entrepreneurs while Cash App is strongly marketed toward young, first-time banking customers. No really, go ahead and look at two things:\n\n- Cash App’s Twitter and advertising strategy\n- The geographic results on Google Trends when searching “Cash App vs. Venmo”. Southern USA generally sees less banking due to increased poverty.\n\nIt is clear as day and the reason is due to the nature of the demographics of underbanked users. You see, access to banking is not much different than access to the internet or access to clean water.  That is, the closer you are to poverty, the closer you are to lacking access to basic resources. What is interesting about Square’s youth &amp; culture strategy is that it builds a life-long trust with the org. You’ve heard it before, “why doesn’t school teach us important thing like taxes or investing?”. Square is attacking that pulse in its design. It offers:\n\n1. The ability to start a business\n2. The ability to invest and educate in basic stocks\n3. The ability to invest and educate in bitcoin\n4. The ability to save on basic purchases\n5. The ability to file taxes (not yet, but the company acquired the means to)\n\nWhat this inevitably means is that we probably won’t even see Square operating at “full-force” until at least 2030 and beyond, as these early aged customers grow with Square and embed more of their financials.\n\n# Speculation\n\nThis is what I expect after examining regulatory environments, product quality, and competitive outlooks:\n\n1. Square will either acquire Sutton Bank or reduce its dependency on Sutton Bank’s regulatory offerings.\n2. Square will become a bank to avoid direct competition with Big Tech, while competing aggressively against Big Banking by offering the ability to ship financial services.\n3. The way they will achieve this is by developing a stronger form of cybersecurity and AI that will allow a smoother verification process.\n4. Square will develop an internet railway, where exchanging currency will be accessible in different mediums like video-games or streams that may compete with orgs like Visa or MasterCard.\n5. Square will compete with Banking-as-a-service and checkout offerings like Stripe, Plaid, and Shopify.\n6. Square will foray into equal housing.\n\n\nPls folllw.\n\nhttps://i.pcmag.com/imagery/reviews/06hGKT6YUeRY99vz4MVPPh0-7..1569477220.jpg",
                "title": "Understanding Fintech: An Essay on my Investment in Square"
            },
            {
                "created_utc": 1611508146.0,
                "num_comments": 1,
                "permalink": "/r/RobinHood/comments/l43bsa/open_call_for_applications_rrobinhood_community/",
                "score": 106,
                "selftext": "Due to current scheduling conflicts among the /r/Robinhood moderation teams, we are in dire need of one or two people to [temporarily] serve as the tiny, bare wire connecting this community with the outside world. If selected, you will be put in contact with Robinhood's Social & Community team on our behalf. You will be expected to join monthly conference calls with Robinhood, make educated decisions on your own, be able to sufficiently implement plans you devise, and be willing to work with the moderation teams here on Reddit and on Discord as required (i.e., be willing and able to ask for help!).\n\nFurther details will be provided to anyone who makes the short list of candidates.\n\n## Who Should Apply\n\nIf you...\n\n* ...are more than marginally interested in the financial industry\n* ...can be depended on in general\n* ...have no conflicts that may complicate serving in the best interest of the **community** of /r/Robinhood\n* ...are excited by the prospect of helping a multi-billion dollar corporation for free\n* ...can clearly communicate ideas by phone and in text\n* ...are willing to stay in regular contact with Robinhood by phone\n* ...are willing to stay in contact with the various moderation teams via [Discord](https://discord.gg/robinhood)\n* ...are old enough to have an account and that account is in good standing with Robinhood\n* ...are willing to work with another person if two are picked for this (or if you have a buddy who'll also apply, that's a bonus)\n\n...you might be who we're looking for.\n\n## How to Apply\n\n[Send modmail](https://www.reddit.com/message/compose/?to=/r/Robinhood). Do not send PMs to moderators and do not contact Robinhood directly. Only applications sent via modmail will be considered!\n\n### What to Include in Your Application\n\nAnswer the following:\n\n1. Who are you on Discord? Provide your username and differentiator (e.g., CardinalNumber#0001)\n \n2. Are you in a position to set aside an hour or so in the middle of the day to handle a scheduled AMA, a conference call with Robinhood, or similar tasks?\n \n3. Have you ever been banned from any subreddits? If so, list them (reason for the ban is not required and will not be considered).\n \n4. In your own words, briefly answer these questions after reading them carefully:\n\n 1. What is day trade buying power, when does it apply, and how is it calculated?\n 2. How long are the settlement periods for stocks, options, and Bitcoin?\n 3. Where were you around 1p Eastern on January 6th, 2021?\n\n5. If selected, what topics of conversation would you most be interested in for future AMAs?\n \n6. Have you ever been involved in an AMA in any way (not specifically as an organizer; just asking quality questions in an AMA will suffice)? The AMA may be anywhere across Reddit on any topic. Links are welcome.\n\n7. What specifically makes you a great candidate for this task? (Previous experience, etc.)",
                "title": "Open Call for Applications - /r/Robinhood Community Manager"
            },
            {
                "created_utc": 1614002859.0,
                "num_comments": 176,
                "permalink": "/r/investing/comments/lpot6m/lets_discuss_what_people_mean_when_they_say_buy/",
                "score": 78,
                "selftext": "I've never really bought in to the whole \"buy the dip\" philosophy for long term investing.  I've always figured when you find a stock that you like for the long term, buy and hold.  Trying to find dips on which to buy just seems like you're going to be buying in at a higher and higher price over time compared to if you just bought now (assuming you were right about the stock in the first place).\n\nLook at Bitcoin, for example.  It's down 10% today so if you like bitcoin, you should be \"buying the dip\" right now, right?  But if you like the investment, didn't you like it a week ago too?  And you could have bought in for 8% lower then than you could buy today.  It would have been much more financially beneficial to buy then, rather that waiting for it to go up so it could drop and you could \"buy the dip\".",
                "title": "Let's discuss what people mean when they say \"buy the dip\""
            },
            {
                "created_utc": 1614115357.0,
                "num_comments": 14,
                "permalink": "/r/stocks/comments/lqtfm2/here_is_a_market_recap_for_today_tuesday_february/",
                "score": 60,
                "selftext": "**PsychoMarket Recap - Tuesday, February 23, 2021**\n\nThe market was extremely volatile today. After opening deep in the red, the S&P 500 (SPY) and Dow Jones (DIA) was able to reverse to close marginally positive. The sell-off in technology stocks continued, with the Nasdaq (QQQ) once again underperforming. The recent pressure on the market comes after a spike in the 10-year Treasury yield that has market participants concerned that inflation will begin to rise. \n\nFederal Reserve Chair Jerome Powell delivered his semiannual monetary policy testimony, offering another update on his view for the path forward for monetary policy during and after the pandemic. In his remarks, Powell reaffirmed that the Federal Reserve was looking to maintain its current accommodative policy posturing for the time being, keeping benchmark rates near zero and asset purchases at the current pace of $120 billion per month. He said, \"The economy is a long way from our employment and inflation goals, and it is likely to take some time for substantial further progress to be achieved. We will continue to clearly communicate our assessment of progress toward our goals well in advance of any change in the pace of purchases.\" \n\nIn Washington, The U.S. House of Representatives Budget Committee voted to advance President Joe Biden's $1.9 trillion virus relief proposal on Monday, bringing it a step closer to passage ahead of a mid-March cliff, after which federal unemployment benefits are set to expire. \n\nIn the last week or two, market participants have been eyeing a sharp spike in Treasury yields, raising concerns of a surge in borrowing costs and inflationary pressures in the post-pandemic economy. The benchmark 10-year yield hovered around 1.36% for its highest level in a year, after wallowing below 1% for most of 2020. That said, the Treasury yield remains at historically low levels. While we expect the spike in the yield to put pressure on the market, our long-term bull thesis remains intact.\n\n**Highlights**\n\n* The U.S. Postal Service said Tuesday it would award a multi-billion-dollar, 10-year contract to Oshkosh Defense to manufacture a new generation of postal delivery vehicles. Shares of Workhorse (WKHS), another company that was vying for that contract, plummeted more than 40% after the deal was announced.\n* Shares of Snapchat (SNAP) reached all-time highs after the company provided an optimistic outlook on ad revenue and customer growth.\n* Apple (AAPL) is planning to increase dividend according to Chief Executive Tim Cook, CNBC reported on Tuesday, citing the shareholder meeting.\n* Facebook said late Monday it will restore news content to its platform in Australia. The company had suspended news sharing last week amid a dispute over a proposed Australian law requiring tech platforms to pay publishers.\n* French antitrust investigators have accused Alphabet Inc's Google of failing to comply with the state competition authority's orders on how to conduct negotiations with news publishers over copyright, two sources who read the investigators' report said.\n* After reaching an all-time high of more than $58,000, the value of Bitcoin (BTC) has plummeted in the few days\n* **Please note many of the current stock prices were written in the morning and probably changed due to intraday movement.**\n* Baidu (BIDU) target raised by KeyCorp from $290 to $390 at Overweight. Stock currently around $322\n* MongoDB (MDB) target raised by Citigroup from $465 to $500 at Buy. Stock currently around $380\n* Palo Alto Networks (PANW) with a host of target raises. Consensus price target of $450 at Buy. Stock currently around $377\n* SEA (SE) target raised by Cowen from $225 to $350 at Outperform. Stock currently around $250\n* Spotify (SPOT) target raised by Rosenblatt Securities from $390 to $425 at Buy. \n\n“The only thing we have to fear is fear itself.” - Franklin D. Roosevelt",
                "title": "Here is a Market Recap for today Tuesday, February 23, 2021. What a crazy day!"
            },
            {
                "created_utc": 1614268293.0,
                "num_comments": 132,
                "permalink": "/r/investing/comments/ls9lct/what_happened_to_gold_as_equity_market_hedge/",
                "score": 59,
                "selftext": "Historically gold has always functioned as a hedge when equity markets went down or inflation went up however I noticed in recent year(s) this is no longer the case.\n\nAgain today there is a stock market sell-off but gold is also down more than 1%. Also with the big correction in feb 2020 gold also went down quite alot. Anybody can explain why this happens?\n\nAnd no, this has nothing to do with money flowing from gold into bitcoin. The gold market is still x times bigger than bitcoin and when monday and tuesday the stock market and gold went down, so did bitcoin so that's not the reason.\n\nOne thing I read somewhere is that it might have to do with (leveraged) hedge funds getting more margin calls when equity markets go down and in order to post cash collateral they have to sell other assets like gold.\n\nNot sure if that makes sense or is even the main reason so why is gold selling off, which is even more surpring since gold has also always functioned as inflation hedge. With investors worrying about inflation lately you would think gold would benifit but even that doesn't seem to be the case.",
                "title": "What happened to gold as equity market hedge"
            },
            {
                "created_utc": 1610728850.0,
                "num_comments": 70,
                "permalink": "/r/RobinHood/comments/kxy874/does_anyone_know_why_the_app_is_doing_this_to_me/",
                "score": 33,
                "selftext": "I am trying to sell my bitcoin that I have and it only allowed me to sell a certain amount of it. I sold it yesterday and thought I would wake up today and it would be resolved in its own.. but no. I don’t know how to post a pic here so I’ll describe what it says and maybe someone who knows more than I can help..\n\nI’m my equity is says $543 (I know it’s not a lot but I need my money), but then when I hit “Sell” it says $0.00 available. Why is this happening and when will my funds become available?!\n\nThanks in advance",
                "title": "Does anyone know why the app is doing this to me?"
            },
            {
                "created_utc": 1614035712.0,
                "num_comments": 60,
                "permalink": "/r/investing/comments/lq2xga/large_cap_companies_investing_in_crypto/",
                "score": 30,
                "selftext": "Tesla announced last week that they had invested $1.5B in Bitcoin.  Having somewhat of a background in corporate governance, but no background in cryptocurrency and blockchain, this concerns me as a stockholder or as a board member.  But I suspect it is due to my own ignorance of blockchain.\n\nMy concern is that, with the alleged anonymity of bitcoin, wouldn't it be super easy for an employee to steal that bitcoin and get away with it?  My understanding is that bitcoin is stored in a secured virtual wallet and a passcode is needed to access it.  So whomever has that passcode can just move money to their own anonymous wallet.\n\nSo how do companies handle that?  Obviously, some companies are holding the bitcoin themselves and hold it through a broker or some other 3rd party.  But then that 3rd party has the same issue.  Even the new Bitcoin ETF - if they hold the bitcoin themselves, how do they secure it?\n\nMy understanding is that every bitcoin is in a wallet somewhere.  And that wallet is accessible - anonymously - by anyone who has the passcode.  Just seems like a very easy embezzlement opportunity.  And one that is easy to cover up, and that law enforcement is likely ill equipment to deal with.",
                "title": "Large Cap companies investing in Crypto"
            },
            {
                "created_utc": 1612555914.0,
                "num_comments": 2,
                "permalink": "/r/SecurityAnalysis/comments/ldg3gk/ray_dalio_what_i_think_of_bitcoin/",
                "score": 25,
                "selftext": "[https://www.bridgewater.com/research-and-insights/ray-dalio-what-i-think-of-bitcoin](https://www.bridgewater.com/research-and-insights/ray-dalio-what-i-think-of-bitcoin)",
                "title": "Ray Dalio - What I Think of Bitcoin"
            },
            {
                "created_utc": 1614177281.0,
                "num_comments": 71,
                "permalink": "/r/investing/comments/lrea2t/ontier_initiates_legal_action_on_behalf_of_dr/",
                "score": 12,
                "selftext": "[ONTIER INITIATES LEGAL ACTION ON BEHALF OF DR CRAIG WRIGHT TO RECOVER £3.5BILLION WORTH OF BITCOIN](https://www.ontier.net/ia/bitcoin-recovery-ontier-press-release.pdf)\n\nWhat does this mean for Bitcoin? Are property right enforceable on a blockchain? I guess Dr. Wright thinks so. Will be very interesting to see how this plays out. This definitely doesn't mesh well with the 'not your keys, not your coin' mnemonic that you typically see.\n\n3.5B stolen though, that's wild...\n\nE: Paul Ferguson, Partner at ONTIER LLP comments:\n\n“Our client always intended Bitcoin to operate within existing laws, notwithstanding the original ethos of independence he envisaged for the digital currency.\n\n“We assert there are identifiable legal obligations attributable to those who develop and control Bitcoin.\n\n“As a victim of theft of some serious magnitude, Tulip Trading is seeking recovery of its access to and control of its digital assets from those in a position to remedy its loss. The fact that someone has stolen Tulip Trading’s digitally-held private Bitcoin keys does not prevent developers from deploying code to enable the rightful owner to regain control of its bitcoin.\n\n“A ruling in Tulip Trading’s favour will have considerable implications for others who have lost access to their Bitcoin or had coins stolen.”\n\n[Letter Before Action](https://www.ontier.net/ia/a1letter-before-action-from-ttl.pdf)",
                "title": "Ontier Initiates Legal Action on Behalf of Dr. Craig Wright to Recover £3.5Billion Worth of Bitcoin"
            },
            {
                "created_utc": 1613971513.0,
                "num_comments": 52,
                "permalink": "/r/RobinHood/comments/lpg0mc/dogecoin_question_need_help_deciding/",
                "score": 6,
                "selftext": "Any info on dogecoin I've been told to buy some but don't know anything about it,  would it be a wise decision to get some ? Do you think it'll be like bitcoin and blow up ? Need some help from someone who knows better than me ...thanks in advance",
                "title": "Dogecoin question need help deciding.."
            },
            {
                "created_utc": 1614364702.0,
                "num_comments": 46,
                "permalink": "/r/investing/comments/lt4itv/potentially_massive_short_sell_opportunity_on_sos/",
                "score": 4,
                "selftext": "[https://twitter.com/HindenburgRes/status/1365359064465702914?s=20](https://twitter.com/HindenburgRes/status/1365359064465702914?s=20)\n\nI know we've all heard it before...\"$0 PRICE TARGET FOR TSLA, THIS STOCK IS WORTH NOTHING!\"\n\nBut hear this one out and read the bombshell evidence Hindenburg Research just dropped on these poor bastards. The company has been exposed by Hindenburg as a fraudulent shell company. All of their PR is seemingly faked or stolen from legitimate bitcoin mining companies. I usually don't pay much mind to $0 price targets because they're usually wildly exaggerating...but you take a look at the evidence they compiled and tell me this doesn't stink of a massive scam. As I write this up, it appears the market hasn't caught on yet but this stock is absolutely going in the toilet off this report when it hits mainstream outlets. The biggest short opportunity I've seen in a long time.",
                "title": "Potentially massive short sell opportunity on $SOS"
            },
            {
                "created_utc": 1614205347.0,
                "num_comments": 11,
                "permalink": "/r/investing/comments/lroqn6/sipp_investor_addvice_uk_looking_at_xmaf_eft/",
                "score": 3,
                "selftext": "Hi Who else hates the state of their pension?\n\nI am, \\[30M\\] Engineer form the UK looking to DIY my pension. After losing yet another job to redundancy my employer pension is stalled yet again.\n\nIve got some Ideas of what I want to do from buying investing books and listening to freaknomics and econtalk.\n\nI have put $2K into a SIPP with ii.com . They charge $10 a month flat fee, that sounded good for longer term when I have hopefully a large amount invested and still spending $120py.\n\nI aim to add $2K per year until retirement. \n\nMy issue was the first EFT pick (I went for EFT as the built in spread and dividend payout plus tiny fees sounded awesome)  \n\n\nI bought $2K of XMAF which tracks top 50 African companies. This appealed to me as a great long term investment as the continent has barely started its industrial revolution and is taking a lot of investment from china for infrastructure to reach its huge natural resources.  \n\n\nI believe this is a non dividend EFT, it also looks very flat and stuck hovering around $8 the past 5 years.\n\nMy second choice was VOO but unfortunately we are not allowed to trade that in the UK due to regulations involving KIDD.\n\n\\[I should also mention I bought 1K of bit coin and sold it for 3K, and a 1K bar of actual gold, and when I went to sell it the post office lost it, so I am the type of investor with the expirence that bitcoin is a safer bet then gold\\]  \n\n\nAm I on the right track here? I want to keep buying these EFT's but the availble ones seems to have similar trends as XMAF.",
                "title": "SIPP Investor addvice UK looking at XMAF EFT"
            },
            {
                "created_utc": 1614338914.0,
                "num_comments": 12,
                "permalink": "/r/investing/comments/lsvtm5/i_believe_kwg_resources_inc_cnsxkwg_and_noront/",
                "score": 0,
                "selftext": "Normally I would be very skeptical investing in penny stocks but I have stumbled upon these two companies trading at pennies and can’t figure out why this isn’t the investment opportunity of a lifetime.    \n\n“Noront holds eight mineral deposits of chromite, nickel, copper, zinc, platinum, palladium, along with 100 documented mineral occurrences with showings of gold, titanium, vanadium, diamonds and cobalt.” I bought a little bit of NOT in 2014 at 62 cents after news broke out that Cliffs Natural Resources announced they would abandon its $550-million investment in the Ring of Fire and sell it to Noront Resources at an eventual 95% discount.  Noront had a 90% claim to the Ring of Fire with a “plan to mine just under one million tonnes of chromite annually, producing enough semi-finished ferrochrome to supply half of the U.S. stainless steel industry.”  At the time of my investment it seemed like relationships with First Nation people was hindering any progress of the mine. “The reason nothing was happening in the Ring of Fire has nothing to do with the value of the deposits. It is entirely due to the inability of governments on all levels, including First Nations, provincial, and federal, to reach consensus on land tenure and development plans.”  Fast forward to 2021 and I’ve lost over half of my money as Noront is now trading at 30 cents.  \n\nSince I bought NOT, the Canadian government has promised to fund the roads needed to start the project.  “The planning and construction is being overseen by a combination of Martin Falls and Webequie First Nations and the Ontario government.  Progress on getting the roads built has been slower than Noront would like, but the company anticipates all the environmental assessments wrapping up by 2023, followed by permitting and two years of road construction leading toward a 2025 completion.  Also, holding a 10 percent stake in the Ring of Fire, KWG Resources, is now forging ahead with a $2 billion railway that would run 330 kilometres, expanding the rail infrastructure in the region for the first time in decades.  I did not buy any shares of (CNSX:KWG) and at the time of writing this KWG is trading at 3 cents.  How is this possible when there seems to be so much in the pipeline for these two companies?  \n\n“Copper, aluminium, chromium, manganese, molybdenum, and nickel are required for a range of low-carbon technologies, making them crucial elements for realizing a low-carbon future,” according to the World Bank Report: Minerals for Climate Action: The Mineral Intensity of the Clean Energy Transition.  Three of these minerals, chromium, nickel and copper can be found in the Ring of Fire.  Both Noront and KWG would seem to benefit from a move towards low carbon technologies and could reap the benefits with an increased need for these minerals.    \n\nOne of these technologies can be seen in the emergence of electric vehicles.   Bloomberg New Energy Finance sees improved batteries, more readily available charging infrastructure, new markets, and price parity with internal combustion engine (ICE) vehicles as major drivers. The study finds that EV’s hit 10% of global passenger vehicle sales by 2025, rising to 28% in 2030 and 58% in 2040. “A quarter of the cost of an EV is the lithium-ion battery, while four-fifths of the cost of the battery itself is the minerals, metals and chemicals going in it.”  Canada Nickel chief executive, Mark Selby, said “it’s become very clear that there’s large portions of the periodic table for which the United States has no local source of supply.” There seems to be a heightened U.S. government interest in securing supplies of critical minerals used in everything from EV’s to advanced weaponry.  If the U.S. would like to limit their reliance on China for these commodities it would be beneficial to work with Canada to export these materials. With such a close proximity to the automobile factories in the United States there would also be huge savings in transportation costs.  Even Elon Musk is asking for it by tweeting, ”I’d just like to re-emphasize, any mining companies out there, please mine more nickel.” And in another tweet, ”Wherever you are in the world, please mine more nickel and go for efficiency, obviously environmentally-friendly nickel mining at high volume. Tesla will give you a giant contract for a long period of time, if you mine nickel efficiently and in an environmentally sensitive way.”   \n\nAs demand for nickel grows the price will continue to rise as the supply gets scarce. In the last year alone nickel prices have gone from 5.01USD/lb to a high of 8.93USD/lb.  This increased price for nickel can only bode well for KWG and Noront.   \n\nJust recently, Noront Resources landed a new strategic partner in Wyloo Metals, the mining division of Tattarang, one of Australia’s largest private investment groups. Wyloo was looking to make some strategic investments outside of Western Australia, particularly in nickel. In looking at investments for a ‘decarbonized’ future, Wyloo is on a global hunt for nickel, lithium and all the metals they think will be important in a low carbon future, particularly in the electric vehicle battery space.  This investment reflects the long-term collaborative strategy to support the discovery and development of the next generation of mines required to meet the growing demand of critical materials needed to power the decarbonization of the global economy.  Wyloo also has a good reputation in dealing well and honestly with the indigenous populations in Western Australia. They will be a great asset in continued negotiations with First Nations people and help facilitate sustainable mining operations in the Ring of Fire.  \n\nIt’s clear to me there is a lot of value in these companies at such a low share price. With KWG building a railroad and Noront building a road, strategic partnerships can be made between both companies. KWG also holds patents to a cheaper and cleaner ferrochrome process that could be very useful to Noront. It may be very likely that KWG could be a takeover target by Noront at some point in the future. But for now it may be beneficial for both companies to develop the required infrastructure they will both need to thrive in the Ring of Fire.   \n\nTo me it seems like investing in these companies is a no brainer and sure to payoff in the future. Am I missing something? Why would someone pay $100,000 for a bitcoin when you can have a share of KWG for 3 cents and Noront for 30 cents?  \n\n\nReferences:  \n\nhttps://www.thesudburystar.com/news/local-news/column-stalled-ring-of-fire-worth-more-than-117-billion\n\nhttps://www.northernontariobusiness.com/industry-news/mining/a-road-to-the-ring-of-fire-is-everything-railway-not-so-much-3449081\n\nhttps://www.thesudburystar.com/news/local-news/kwg-forging-ahead-with-ring-of-fire-railroad\n\nhttps://www.thestar.com/news/canada/2021/02/23/china-europe-winning-ev-battery-arms-race-house-committee-told.html\n\nhttps://canada.autonews.com/electric-vehicles/canada-nickel-held-talks-us-government-supplying-metal-ev-batteries\n\nhttp://www.bnnbloomberg.ca/elon-musk-is-going-to-have-a-hard-time-finding-clean-nickel-1.1483442\n\nhttp://www.mining.com\\*\\*\\](http://www.mining.com/)\\[\\*\\*https://sdg.iisd.org/news/world-bank-warns-against-impacts-of-low-carbon-technologies-on-mining\n\nhttps://www.whitehouse.gov/briefing-room/statements-releases/2021/02/24/fact-sheet-securing-americas-critical-supply-chains/\n\nhttps://www.bnnbloomberg.ca/why-the-future-is-bright-for-nickel-exploration-1.1562606\n\nhttps://www.researchgate.net/publication/322603576_Direct_Production_of_Ferrochrome_by_Segregation_Reduction_of_Chromite_in_the_Presence_of_Calcium_Chloride\n\n\nTickers:\nhttps://ca.finance.yahoo.com/quote/KWG.CN/\nhttps://ca.finance.yahoo.com/quote/NOT.V/",
                "title": "I believe KWG Resources Inc (CNSX:KWG) and Noront Resources Inc (CVE:NOT) are a great long-term investment opportunity. But what do I know. I’m just an unemployed banquet server."
            }
        ]
    },
    "gamestop": {
        "is_stock": false,
        "submissions": [
            {
                "created_utc": 1614224670.0,
                "num_comments": 786,
                "permalink": "/r/stocks/comments/lrxbvv/gme_short_squeeze_what_comes_next_part_4/",
                "score": 3799,
                "selftext": "**Warning: This is a very risky play, trade at your own risk**\n\nHello, All!\n\nIf you are not familiar with this saga, feel free to catch up:\n\n[First Mention](https://www.reddit.com/r/stocks/comments/k3p4bc/when_will_the_gme_squeeze_happen_answers_here/)\n\n[Short Squeeze Explanation and Initial Thoughts](https://www.reddit.com/r/stocks/comments/k688qv/for_those_who_dont_understand_the_inevitable/)\n\n[Timeline and Predictions](https://www.reddit.com/r/stocks/comments/kaa2qh/gme_either_squeezes_or_gets_delisted_who_will_win/)\n\n[GME Short Squeeze What Comes Next Part 1](https://www.reddit.com/r/stocks/comments/laln2m/gme_short_squeeze_what_comes_next/)\n\n[GME Short Squeeze What Comes Next Part 2](https://www.reddit.com/r/stocks/comments/lbuhp0/gme_short_squeeze_what_comes_next_part_2/)\n\n[GME Short Squeeze What Comes Next Part 3](https://www.reddit.com/r/stocks/comments/lgkm5t/gme_short_squeeze_what_comes_next_part_3/)\n\n[GME Short Squeeze What Comes Next Part 4 (Micro Update)](https://www.reddit.com/user/hooman_or_whatever/comments/lm92zw/gme_short_squeeze_what_comes_next_part_4_micro/)\n\nBefore I get started I want to apologize, this will be a smaller less detailed version than I had hoped and I will not be releasing a video as I feel extremely under the weather. However, I have received a large volume of messages regarding part 4 and my analysis, so here it is.\n\nFirst, let's address something that I find very misleading: \"this happened on absolutely no news\"\n\nWell, that simply isn't true. I will mention some key things that led up to this point and would like to also quickly mention the 3-day rule. If ER is bad, you follow the 3 day rule meaning you give it 3 days to bleed before it begins to recover. This is the same for the news cycle. Even the first squeeze when Cohen was announced to be joining the board, it took several days before the market react.\n\nOk, so let's talk news. \n\n1. We have passed the first potential catalyst which was the first GME hearing [which unfortunately, was filled with useless information](https://www.reddit.com/user/hooman_or_whatever/comments/lnkmrn/gamestop_gme_short_squeeze_congressional_hearing/?utm_source=share&utm_medium=web2x&context=3).\n2. Another catalyst I mentioned was today, the short interest report that was post Jan. 28th spike. [Morningstar](https://finra-markets.morningstar.com/MarketData/EquityOptions/detail.jsp?query=126:0P000002CH) is reporting 60% and [Fintel](https://fintel.io/ss/us/gme) is reporting 24%. Again, the discrepancy between the two is simply based on a calculation difference using a different float. One is including synthetic longs while the other is not. This is the first mention I could find regarding the [XRT discovery](https://www.reddit.com/r/GME/comments/lknjkc/xrt_is_being_used_to_hide_gme_shorts_xrt/) and how shorts may have actually essentially moved their positions into an ETF that includes GameStop. At this point, there are so many moving parts and distrust, I'm having trouble assessing what the true short interest might be. Regardless, even if we use the 24% figure and respect that to be true, [this is still considered very high.](https://www.powercycletrading.com/what-is-a-high-short-interest-ratio/#:~:text=Regardless%2C%20most%20options%20traders%20would,above%2020%25%20is%20extremely%20high)\n3. Following [iborrowdesk](https://iborrowdesk.com/report/GME) we can also see a significant amount of new short positions opening over the past several days, probably an attempt to short the stock but without it being reported in todays numbers.\n4. Chamath also expressed anger regarding how the Congressional hearing went and followed it up with [this tweet](https://twitter.com/chamath/status/1363571801289154560). I personally believe Chamath was one of the several large buy orders today.\n5. Ryan Cohen also [tweeted one of his infamous emoji tweets](https://twitter.com/ryancohen/status/1364650709669601289). Now, I'm not going to bother to attempt to decipher it, but when he Tweets, GME spikes much like when Elon tweets about Doge, it spikes. \n6. The [GameStop CFO \"resigns\"](https://www.cnn.com/2021/02/23/tech/gamestop-cfo-resigns/index.html#:~:text=New%20York%20(CNN%20Business)%20After,his%20roles%20on%20March%2026) which later news indicates he didn't really willingly resign. This is extremely bullish as GameStop continues to make changes. If the company was losing money for years and the man in charge of money was just fired, this is a *good* thing.\n7. [DFV doubled down](https://www.reddit.com/r/wallstreetbets/comments/lnqgz8/gme_yolo_update_feb_19_2021/)\n\n**Ok, now let's discuss some of these things**\n\n1. The GameStop hearing was simply a joke. The next hearing will paint a more clear picture regarding data as the SEC, FINRA, and potentially, the DTCC will be present.\n2. Let's talk short interest. As I have mentioned in previous parts, I have no doubt that original shorts have covered and new shorts have entered. A clear battle I have had in the comments is a lot of individuals seem to believe that shorts only re-opened their positions at the top and that's it. I couldn't disagree with this more. The narrative of GME being a dying brick and mortar company is alive and well, and shorts will continue opening positions all the way down. We saw many new positions open today when it was around $50. There are shorts everywhere, and they completely doubt this company and everyones willingness to hold and continue purchasing more, both for retailers and institutions. \n3. Chamath, Cohen, and DFV was a much needed intervention which brought back excitement and truthfully, they probably purchased more shares themselves. \n\n**Sorry had to take a bathroom break, like I said I'm feeling very unwell and apologize that this isn't quite as good as my other posts.**\n\n**Let's talk about what happened today**\n\nI believe today was a gamma squeeze with shorts in the worst positions having to cover. I concur with [this post](https://www.reddit.com/r/stocks/comments/lrrcdk/gme_gamma_squeeze_part_two/) regarding the gamma squeeze and how it started the domino effect. \n\nI predicted that a large sum of shorts were sitting just over $200 and the AH action helps bolster that claim. We saw the price touch $200 for a moment and then get swatted down like it was a gnat. They absolutely do not want it to break the $200 mark.\n\n**But onto the important part, my predictions as to what comes next**\n\nNow, I'm about to say something very silly but the reason is I want you to make your own decision on what the most likely outcome is.\n\nTomorrow, either the price will come plummeting down, or it will rise to new, extraordinary heights.\n\n1. Reason for it to shoot down: There are a lot of bagholders, a lot of individuals who are simply trying to escape with at least their money back. Depending on pre-market, we could expect a large sell off at open as people reclaim their losses. This sell-off will induce a panic sell that causes everyone to exit in an attempt to mitigate as many losses as possible.\n2. Reason for it to shoot up: There are a lot of bagholders...who won't be satisfied by just breaking even and will refuse to exit until it breaks $1000-$2000. Depending on pre-market there will also be a lot of people who missed the first run have less doubt in their mind for a potential second run. FOMO and sheer buying power will continue to drive the price upward.\n\nBoth of these are considering retail investors only, although the ATH price action compared to volume suggests there are significant amounts of institutional and \"large whale\" buyers getting in on the action. They both are also dependent on pre-market so let's talk about that for a moment.\n\n**Pre-Market**\n\nWhile institutional buyers don't necessarily need retail for this to work, it certainly wouldn't hurt to have reinforcements, so I think they won't begin a bull run until the market opens and retail investors have a final chance to double down while new investors have a chance to purchase their tickets. \n\nHowever, if they seemingly don't care and want to buy as soon as able then we will test that $200 resistance. If that is broken...this is going to be absolutely wild. The domino effect will continue upward chasing the shorts who entered at the very top. It would be wise for these shorts to cover prior to it reaching them as they could still take profits and walk away with a significant sum of money. This will propel the price extremely high at which point nearly all shorts would have exited. \n\n**During Trading Hours**\n\nAgain, completely dependent on pre-market, but I still expect a decent sell-off in the beginning of the day as bagholders escape with breaking even happily. If we open above the $200 mark and the selloff does not appear to be driving us below, I expect the shorts who entered their to cover and this reaches parabolic heights.\n\n**Price Targets**\n\nWell, I first want to talk about the infinite squeeze notion. I agree with the sentiment but not for the same reasons most users post about. Here's the thing, everyone still considers GME to be a dying brick and mortar retailer aside from few longs such as myself. That narrative is slowly changing as more and more individuals start to see the significant changes being made within the company. So long as this mentality lives on...so does repetition.\n\nI expect this squeeze to conclude sometime this week, perhaps even tomorrow. What's unique here is we have all now lived through the first one and we will make decisions accordingly, IE taking profits or covering earlier. \n\nBut on the way back down....shorts will open new positions....again. \n\nA new catalyst will arrive....again.\n\nAnd we will squeeze...again.\n\nI'm not sure how many times this will happen, but I think after 3/25 ER when Cohen globally explains the changes being made and the plans for the company, the narrative will begin to change on GME's business. Until the narrative changes, I expect shorts to continue re-entering at dangerous positions. $50 sounds like a fantastic place to short if you believe this is a dead company, but the market sentiment is changing rapidly on the potential of this company. Once shorts are only entering at ridiculously high numbers, then we will finally see the end of the GME saga. \n\nI think a second squeeze will be evidence enough to shorts to not enter at such low numbers, however, greed and doubt goes a long way. So it's very possible this is the final squeeze, but I'm not holding my breath. I will address how I plan on playing this in the next section, but first, some price targets.\n\nSo long as we break the $200 resistance, we will have many short positions above that level that will close to avoid getting caught in the red as well as gamma squeeze mechanics at play. That being said, I could see $500 being possible as early as tomorrow. Now the top is so difficult to predict because one of the largest factors is the most unpredictable; the people. Many people were burned by GME and many others have serious FOMO. If there is large volume, then that will be my indicator that people are piling in all over again. If this is the case, I see $1-$2k being possible. If bagholders simply want to exit and take their money back then I think $500 might be the dream peak. \n\n**So whats your play Hooman?**\n\nWell, as I have said before I am long on GME. So I will be trimming on the way up and leaving some just in case it continues to parabolic heights. I will then re-enter when I believe we hit the bottom which I feel confident starting to re-enter at $70 adding more on the way down. I will then hold tight for another potential squeeze and repeat this process until finally, the GameStop narrative has changed and I could leave my shares along for several years. \n\n**Again, I do apologize** \n\nI know this isn't quite as good as my previous posts, but I wanted to update everyone who was asking me to provide them with my analysis. Part 5 will be coming regardless of what happens tomorrow as I stated numerous times, I don't think this story is anywhere near over, not until April do I think we will start seeing it slow down. \n\n**TL;DR:** Today was most likely a gamma squeeze coupled with some shorts covering. There were significant catalysts and whales to propel this thing. I don't think the GameStop story is anywhere near over. I'm sick sorry this was choppy writing compared to other posts.\n\n*Disclaimer: I am not a financial advisor, I am long on GME, this is a risky trade, thanks for reading.*",
                "title": "GME short squeeze what comes next part 4"
            },
            {
                "created_utc": 1613656817.0,
                "num_comments": 98,
                "permalink": "/r/RobinHood/comments/lax3b6/house_financial_services_committee_hearing_game/",
                "score": 369,
                "selftext": "View a live stream of this virtual hearing which will begin February 18th, 2021 at 12p: [https://financialservices.house.gov/live/](https://financialservices.house.gov/live/)\n\n**Robinhood CEO Vlad Tenev is expected to testify.**\n\nCommittee Membership: [https://financialservices.house.gov/about/committee-membership.htm](https://financialservices.house.gov/about/committee-membership.htm)\n\n--- \n\n**Congresswoman Maxine Waters (D-CA)**, Chairwoman of the House Committee on Financial Services, made the following statement regarding recent market instability:\n\n>Hedge funds have a long history of predatory conduct and that conduct is entirely indefensible. Private funds preying on the pension funds of hard working Americans must be stopped. Private funds engaging in predatory short selling to the detriment of other investors must be stopped. Private funds engaging in vulture strategies that hurt workers must be stopped.  \n>  \n>Addressing that predatory and manipulative conduct is the responsibility of lawmakers and securities regulators who are charged with protecting investors and ensuring that our capital markets are fair, orderly, and efficient. As a first step in reining in these abusive practices, I will convene a hearing to examine the recent activity around GameStop (GME) stock and other impacted stocks with a focus on short selling, online trading platforms, gamification and their systemic impact on our capital markets and retail investors.  \n>  \n>We must deal with the hedge funds whose unethical conduct directly led to the recent market volatility and we must examine the market in general and how it has been manipulated by hedge funds and their financial partners to benefit themselves while others pay the price.\n\n--- \n\nRelated press release: [https://financialservices.house.gov/news/documentsingle.aspx?DocumentID=407102](https://financialservices.house.gov/news/documentsingle.aspx?DocumentID=407102)",
                "title": "House Financial Services Committee Hearing - \"Game Stopped? Who Wins and Loses When Short Sellers, Social Media, and Retail Investors Collide.\""
            },
            {
                "created_utc": 1612620619.0,
                "num_comments": 3,
                "permalink": "/r/SecurityAnalysis/comments/ldybgf/ben_hunt_comments_on_spacs_gamestop_and_current/",
                "score": 141,
                "selftext": "I watched recent Real Vision interview with Ben Hunt. I think he has some very interesting thoughts but the interview is a bit obscured. You can watch it in full here: [https://www.youtube.com/watch?v=uc0yN7VCuOU](https://www.youtube.com/watch?v=uc0yN7VCuOU) (30 minutes in). Below are few quotes which I found quite interesting.\n\n&#x200B;\n\nOn SPACs:\n\n&#x200B;\n\n>See, how can I put this kindly? I can't, so I'll say it. The narrative, the story that we see around WallStreetBets, that we see around SPACs, the story is that this is democratization of markets, it's bullshit and the the people who are presenting that as their message are bullshitters. I can't say it nicely so I just had to say it that way. It is just, its another story, that's what Wall Street has always been and frankly it's what I think it will always be. \\[...\\] Do I like what Wall Street did in reaction to Reddit? To change the capital posting rules at the clearing house overnight, to give Stevie and Gabe and other guys a day to throw the ballast and trim their sails so they could survive? No, that's bullshit too. There's a lot of it to go around but what really eats at me \\[...\\] it's the mendacity of the people who say either \"Oh, no, its our liberty, this is the best of all possible worlds that we give all of our money to Ken Griffin\", or similarly its the people who say \"Oh, no, we need a transaction tax now, that's clearly what we need to do here\" or \"Oh, no, this is democratization of markets. And by the way come put your money into my SPAC or into my ETF of SPACs\". I call them raccoons. I mean they are huckster animals that financial services are frankly infested with. Always has been, always will be but by golly if you see it you got to call it out.\n\n&#x200B;\n\nIn answering comment about people getting hurt investing in volatile equities;\n\n&#x200B;\n\n>A lot of people have been hurt but welcome to the world man and these people are not your friends. Right, these people are not your friends. You are being used, you are not being treated as autonomous human being. You are being used as fodder and that was clearly true in the GameStop. And look, we went back, we've been analyzing the language, the linguistics of what you saw on WallStreetBets and what you see is that about a couple of months ago the language changed, the linguistics changed. There was absolutely, absolutely, a planned effort, I liken it to the, I call it the snowball theory of markets, to start a snowball at the top of the hill and to be positioned for where that snowball could end up, before the avalanche could end up and trying to roll some snowballs down the hill. You don't know which of these snowballs is going to take off or which is going to click as a meme but you do it enough and one of them is going to click and this democratization, you know, to the moon, diamond hands, stick it to the man by buying GameStop calls. This was absolutely a plan, it didn't happen organically and it sure ain't part of some democratic uprising. \n\n&#x200B;\n\nFinally, answer to the question what is the meta narrative that country most needs to grapple with, most needs to understand and most needs to digest in order to get to a view of reality that corresponds to their model;\n\n&#x200B;\n\n>I think the most important thing, and I'll use a poker analogy here, you know the old line that if you don't know who the sucker is at the table after 30 minutes, it's you. The important thing here is not to stop plying poker, not to say \"Oh my god, the game is rigged and I'm out of here\", it's not to get off the grid and, you know, live out in the wilds of Alaska. The important thing here is to preserve some distance in your mind and in your heart between yourself and what you are told. To recognize that everything in markets and everything in politics is somebody shaking their finger at you and trying to tell you how to think about the world, what multiple should you put on this, what is the story we are going to put around the markets or this election or what have you. And its not to say you don't act in markets and elections. You vote, you invest, you do all that but you don't take these stories into your heart. You maintain a critical distance so that you maintain your autonomy of mind. If there's one message out here, its to do that. To think critically about everything you are reading here. Not to criticize it, but to think critically. Why am I reading this now? Why am I hearing this now? And if I step back, if this is something that I think fits with high school math?",
                "title": "Ben Hunt comments on SPACs, GameStop and current meta-narrative"
            },
            {
                "created_utc": 1614359660.0,
                "num_comments": 167,
                "permalink": "/r/stocks/comments/lt2i35/a_slap_back_to_reality/",
                "score": 124,
                "selftext": "Obligatory: This is not financial advice. I am not a ~~cat~~ financial advisor\n\n&#x200B;\n\nI believe, in a time like this, a lot of people need a fresh glass of some ice cold water...\n\n# Splashed right into their faces.\n\nTl;dr Ape explanation: I want GME to moon, but I am concerned about people being fed false information. 1. The claim Melvin said they didn't close their short position at the hearing is a lie. Their opening statement specifically had them saying they DID close it. 2.  The strategy of ITM calls boosting the price was tested last time & failed last time. These are covered calls. 3. There isn't enough of a short interest to force the price up by holding. The profit comes when HF close positions, but you won't know that happened until it's over.\n\n&#x200B;\n\nI would love to see GME rocket to the moon. And I believe there is a scenario where that can be possible. But I want to go over the popular scenarios that will deceive you into believing THEY are the scenarios that will lead you to the moon. This is not a bear post against GME. This is reality.\n\n* This is for those of you newcomers who thought you missed out on the last GME wave.\n* This is for those of you who were stuck holding the bag last time (me, included) and are looking at profiting from this time to make that money back.\n* This is for those of you who just didn't learn your lesson, and need a reminder of what went down last time.\n\n&#x200B;\n\nAs I said, there are scenarios where GME can be squeezed. But what scenario is that? And what scenarios are not that?\n\n&#x200B;\n\n1. First thing first, I want to stop a lie that I have seen spread like wildfire. The blatant lie that Melvin Capital, during the Gamestop hearing, admitted to not closing out their short position on Gamestop. This is not true. Now, I am going to assume whoever came up with this lie, did it as a *valiant* effort to help boost the price of Gamestop, and probably hoped no one would call them out on their BS, because nobody else decided to waste their time, watching a 5+ hour congressional hearing about stocks. Those are about the two most boring things in the world, combined. But, you don't even have to get that far into the hearing to call this lie out for the BS that it is. In Melvin Capital's opening statement, within the first minute of it, they state they closed out of their short positions in GME days before any restrictions were put on it. You can look up videos of the opening statements, yourself. I won't baby you that much. So, in conclusion, don't rely on the scenario that Melvin never closed out their short positions. It's a lie and it needs some water doused on it.\n\n&#x200B;\n\n2. Scenario Two, possibly the most believed strategy on GME Thursday/Friday: \"Keeping the price over **(insert dollar amount here),** by Friday close, makes **(insert number here)** of calls ITM, and when they cover, the price is going to rocket!\" Now, I am not going to say this scenario is impossible, but it is not very likely, and it is what got many people burned the last time. Yes, it is true, keeping the price over a certain price, making a lot of calls ITM, can be good for the stock... **IF** those calls aren't covered calls, which I believe that almost all of them are. The week ending Jan. 22nd, there are probably a lot of naked calls. That hurt the sellers, bad, when GME closed at a very high price. Nobody expected it. That helped it a lot the following week when we saw the big spike. But then, let's run down what happened that following week. Yes, RH restricted buying on Thursday, 28th, which I do believe stopped the biggest of the squeezed, but it would not have played a role in the ineffectiveness of the \"Calls ITM\" strategy that followed. That Thursday, the price plummeted into the $200s. That Friday, you heard a lot of chatter of ***\"As long as we can get the stock up to $310, a lot of calls will be ITM and we will be golden, my fellow apes! Get it to $320 and that's bonus points. That will be 90k calls that will be ITM and have to cover. That's 9 MILLION SHARES!\"*** And yeah, A lot of that was true. There were 90k calls that would be ITM if we closed above $320. And you know what we did? We closed above $320. We closed around $328, in fact. This was it. Come Monday, that price was going to the moon. *\"10k isn't a meme!\"* We chanted. We couldn't be wrong. We did the maths. We had the DD. Diamonds don't crack, baby! Well, come Monday, there was no lift off. It was the Space Shuttle Columbia all over again. The stock fell, and it fell hard. Going back into the low $200s, dipping into the $100s even, before closing in the $200s. That's okay though. That's fine. They had until Wednesday to *actually* close on those Calls, you'd hear. So Tuesday came and went. Then Wednesday too. We never saw $300 again. In fact, by Friday, we were barely even seeing $100. So what happened? What went wrong? We had maths **AND** anime on our side. Well, what I believe happened is, those Call contract sellers learned their lesson that first week that ended Jan. 22nd, when they got screwed. They didn't let their calls be naked the following week. They bought up GME stocks when it was low at the beginning of that week, if they didn't already have them. This allowed them to resell those stocks at $320 and under, making them the big winners in all of this. But that meant these weren't NEW stocks that would help us go higher. No, these were stocks bought on the way up. They helped us peak but wouldn't help us go ***over*** the peak. So, when those calls executed, there were suddenly a lot of new holders of GME stock. Holders who saw their stocks were worth $300-$320. These weren't diamond handers, like you or I. These apes wanted their bananas ***NOW.*** So they sold when they got them. Gotta cash in those profits at some point. As WSB loves saying \"*You can't lose if you don't sell\"*. Well, you also can't win if you don't sell. So now flash forward a month later, and the same theory is being pushed. \"*Keep the price over $100 and we will rocket to $800 come Monday. No, scratch that, $1000. No, wait, even better. $69,420!\"* You hear in the echo chamber, bouncing off the walls like GME does in the first 30 minutes of market open. That's not going to happen. These are covered calls that are ITM. You're not forcing anyone to buy new stocks at the current price. You are just buying stocks for $50-$100 that were already bought at $40-$60 and are keeping the stock price stagnant. And none of this is even mentioning that the amount of ITM calls this time is like a third of what it was last time. So, do not rely on this strategy.\n\n&#x200B;\n\n3. Scenario Three: *\"tHeY hAvE tO cOveR. tHeN wE cAn sEt oUR oWn pRicE\"*. This is probably the most ignorant reason, and is why I typed it out like that. Yeah, I'm mocking you. Get over it. it is true, they do have to cover eventually. But not with your stocks. GME short interest is somewhere around 45-50% (too lazy to relook up the actual number), and this is after new reports showed 1.3 million more shares were shorted on Wednesday. Now, yes, that is a high amount of short interest. But that isn't high enough for the **\"Diamond Hands\"** approach. There's still 50ish percent of shares out there, not shorted. And yes, Diamond Handers hold a lot of those, most are going to be held by institutions and those institutions are about the money, not the message. They see a 3x profit? They sell. They sell to whoever is willing to buy. Could be more Diamond Handers, could be hedge funds. But eventually, Apes are going to run out of money to buy and hold with. That's when the Hedge Funds can swoop in, buy up these stocks, cover their short positions. The people they borrowed from might not be Diamond Handers, and end up selling to more Hedge Funds. When the short interest is only around 50%, you can't win with the Buy/Hold strategy. When the short interest is 50%, the short squeeze happens and you don't know it happens until it is over and the Hedge Funds have covered. You win by riding the wave up as Hedge Funds cover and then you get out near the top. That's the end of your ride. The ride doesn't just keep going up. You can only set the price when you own most of the market, and in this case, we don't. And on top of all of that, you also have people who are doing this with their bill money. The 1st of the month is coming up, that's a lot of rent needing paid. No shame in needing to sell so you can pay your bills. But, that's more shares that will flood the market. Probably a fraction of the actual amount of shares out there, but pennies add up to dollars eventually.\n\n&#x200B;\n\nAnd those are the three scenarios in which you have a higher chance of losing than winning. Again, I cannot stress this enough: I **DO** believe a short squeeze can happen with GME. But I do not believe it is any of these three scenarios that will make it happen. I'm just tired of seeing people being fed these these  delusional optimistic claims that throw truth, history, and **REAL** DD & common sense out the window, treating GME more like a pump n dump than an actual short squeeze.  it's okay to drink the Kool-aid, but maybe check to make sure it isn't spiked first.",
                "title": "A Slap Back to Reality"
            },
            {
                "created_utc": 1614403181.0,
                "num_comments": 59,
                "permalink": "/r/stocks/comments/lth29r/robinhood_to_plan_confidential_ipo_filing_as_soon/",
                "score": 51,
                "selftext": "Robinhood Markets Inc., the trading platform behind the boom-and-bust swing in GameStop Corp.’s shares, plans to file confidentially for an initial public offering as soon as March, according to people familiar with the matter.\n\nThe company has held talks in the past week with underwriters about moving forward with a filing within weeks, said the people, who asked to not be identified because the matter isn’t public. No final decision has been made and the timing could change, the people said.\n\nA representative for Robinhood, based in Menlo Park, California, declined to comment.\n\nRobinhood exploded in popularity during the pandemic as homebound young people turned to its trading app to make money and pass the time. The company, which has been targeting a 2021 IPO since at least last year, faced a cash crunch when it ran into regulatory trouble three weeks ago.\n\nRobinhood had to draw down its credit lines and raise $3.4 billion from its backers to post more collateral with the Depository Trust & Clearing Corp., the industry’s clearinghouse. The DTCC wanted members to post more cash to ensure they could clear trades, given wild swings in stocks including video game retailer GameStop and movie theater chain AMC Entertainment Holdings Inc.\n\nRobinhood is also facing political and customer backlash because it temporarily curbed trading in GameStop and movie theater chain AMC Entertainment Holdings Inc.\n\nRobinhood is also facing political and customer backlash because it temporarily curbed trading in GameStop and other stocks.\n\nRobinhood was valued at $11.7 billion in a funding round last year. That company has been considering selling some of its shares in its IPO directly to its own users, Bloomberg News reported. Such a move would be striking because retail investors usually don’t get to buy into new listings at the offering price. Instead, they typically have to invest on the first day of trading in a rush that can drive up the stock price.\n\n[https://economictimes.indiatimes.com/markets/ipos/fpos/robinhood-to-plan-confidential-ipo-filing-as-soon-as-march/articleshow/81239789.cms](https://economictimes.indiatimes.com/markets/ipos/fpos/robinhood-to-plan-confidential-ipo-filing-as-soon-as-march/articleshow/81239789.cms)",
                "title": "Robinhood to plan confidential IPO filing as soon as March"
            },
            {
                "created_utc": 1614502897.0,
                "num_comments": 4,
                "permalink": "/r/stocks/comments/lubffm/selloff_for_paying_capital_gain_tax/",
                "score": 4,
                "selftext": "After reading Wikipedia's dot-com crash section on events leading to crash, it mention that whoever made a huge realised stock gain in prior year will sell some share now to pay for capital gain tax (realised gain only).\n\nJust for example whoever made 100% on Gamestop that realised gain while reinvest into other stock, will need to sell off some share now to pay for tax. \n\nBut the question is how big is the volume of short term trader had realised gain during 2020 and need to sell share now just to pay the capital gain tax?\n\nAnyone have any insights on this? Or the volume is actually too small to move the market?",
                "title": "Sell-off for paying capital gain tax?"
            },
            {
                "created_utc": 1614488988.0,
                "num_comments": 5,
                "permalink": "/r/stocks/comments/lu75zf/any_good_investing_books/",
                "score": 1,
                "selftext": "I'm a newer trader and starting to get more serious after GameStop, where I have made a sizeable amount of money for a broke high schooler. I have the basics of the stock market down, and surprisingly reading about the insides of GameStop has really helped me understand the market o a little bit better. I have about 5 books narrowed down and was wondering if anyone had read these books or had heard about them.\n\n   \n**The Intelligent Investor: The Definitive Book on Value Investing. A Book of Practical Counsel (Revised Edition)**  \\-  by Benjamin Graham, Jason Zweig  \n\n&#x200B;\n\n   \n**Iron Condor Options for Beginners: A Smart, Safe Method to Generate an Extra 25% Per Year with Just 2 Trades Per Month**  \\-  by Freeman Publications  \n\n&#x200B;\n\n   \n**Covered Calls for Beginners: A Risk-Free Way to Collect \"Rental Income\" Every Single Month on Stocks You Already Own**  \\-  by Freeman Publications  \n\n&#x200B;\n\n \n\nCredit Spread Options for Beginners: Turn Your Most Boring Stocks into Reliable Monthly Paychecks using Call, Put & Iron Butterfly Spreads - Even If The Market is Doing Nothing -  by Freeman Publication \n\n&#x200B;\n\n   \n**A Beginner's Guide to the Stock Market: Everything You Need to Start Making Money Today** \\-  by Matthew R. Kratter  \n\nJust to preface, I do not plan on doing options anytime soon, but I would like to understand do I can paper trade them and get a feel for how they might be properly used.",
                "title": "Any good investing books?"
            }
        ]
    },
    "roblox": {
        "is_stock": false,
        "submissions": [
            {
                "created_utc": 1613994031.0,
                "num_comments": 1496,
                "permalink": "/r/stocks/comments/lpm13n/roblox_expects_shares_to_begin_trading_on_nyse/",
                "score": 8720,
                "selftext": "Gaming company Roblox expects to be trading publicly on or about March 10, per Bloomberg. The company will be going public via direct listing, similar to Palantir and Spotify most recently. The company is currently valued around $29.5B.\n\nStill undecided on investing, will probably sit on it for a week or so to see direction.\n\n[S-1 filing](https://www.sec.gov/Archives/edgar/data/1315098/000119312520298230/d87104ds1.htm)\n\nEdit: just because it's in the comments a bunch, price should be around $45/share on release. Good luck getting that price before it jumps.\n\nEdit 2: Ticker will be RBLX and you can buy it through your broker just like you'd buy any normal stock. No crazy IPO hurdles in a direct listing, Roblox will be selling shares directly to the open market.",
                "title": "Roblox expects shares to begin trading on NYSE March 10"
            },
            {
                "created_utc": 1614194726.0,
                "num_comments": 363,
                "permalink": "/r/investing/comments/lrl4qf/thoughts_from_my_personal_experience_with_roblox/",
                "score": 1548,
                "selftext": "You can look at their books, but I believe it’s difficult to make an informed decision about $RBLX without some experience with the website and games themselves. Here are some of my thoughts from being an active member since 2007. Feel free to ask me any questions you might have about the platform.\n\nRoblox has been available to the public since 2006; you’re not investing in a new up & coming company. It’s been around for 16 years, which is very long for an online game. That in itself is a good sign, but its potential and success is pretty cemented as of now. The lack of worldwide reach (with the majority of users being from North America) is worrisome, but there may be room for growth.\n\nThey are currently sitting at **2.4 billion** registered users. The daily active user (DAU) count is somewhere around **30 million** (see S-1 form in my edit).  Thus, the vast majority of registered users are inactive users or bots who prey on dumb kids to steal their account info via cookies. This is more of an anecdote than something you can really back up with hard numbers and data because it’s obviously not something Roblox tracks itself. Every group and comments section on Roblox is plagued by bots spamming fishy links that take you to places for “free Robux” and such. There’s a game on Roblox called New User Machine that tracks the total amount of players and shows the most recently created ones. Basically, it’s a conveyer belt of bots with random letter & number usernames. Their security and captcha, to summarize, sucks.\n\nRoblox itself is a game client, but the website houses a variety of games made by users, of varying quality. There are some real gems but some real garbage as well. The front page cycles the same popular games and not a lot of up-and-coming ones. I can imagine it would be quite difficult to break into the algorithm if you’re not already a popular developer. Some people use/pay for bots to pump up their game’s likes and user count. This is obviously against the site's TOS, but it’s difficult to get ahead unless you pour hundreds into on-site ads.\n\nYears ago, they shut down the forum, which contributed to a lot of helpful and insightful on-site discussion. They did so because they believed it was becoming difficult to moderate. Hire more moderators? That on top of the fact that the chat filter (both on-site and in-game) is becoming increasingly overbearing, it’s difficult to hold a conversation on the website, let alone form a tight-knit community. I feel a community is **essential** to the success of a social game platform like this one; right now, it feels like a soulless, barren corporate wasteland, compared to what it was before. Take a look at their [logo change](https://logos-world.net/wp-content/uploads/2020/10/Roblox-Logo-History.jpg), which summarizes the company’s new ethos well. There’s the argument that the chat filter needs to be overbearing because of the possibility of online predators - which is true - but there’s a difference between overbearing and broken. Sometimes, every second word is censored, even completely innocent ones.\n\nTheir customer support is pretty dismal. Not much else to say here, but I’ve personally dealt with it, and unless you are asking something really basic that can be answered by looking at the FAQ, they’re not much help. Just your typical outsourced copy & paste replies. When it comes to accidental moderation resulting in bans or account deletion, or account theft, they’re not very helpful. I’ve had an account made in 2010 deleted in 2016 for something I did not do (account theft; the account itself was stolen) and they were no help.\n\nYears ago as well, the “free” currency Tickets were removed, leaving the premium one, Robux. Tickets were awarded on daily login and could be used to purchase cosmetics and such. Now, join any game and almost every avatar you see is the default one because the vast majority of kids aren’t paying for the premium membership which gives you monthly Robux, nor are they paying for Robux itself.\n\nThus, parent’s wallets are the limiting factor on how much Roblox can grow, because a lot of the older base such as myself shares the same sour sentiment regarding the website as a whole. Even newer users are seen calling for the “glory days” of Roblox to come back, which is odd since they themselves did not experience those “glory days”. That being said, the general community sentiment seems that not many people are happy with the site in its current state, which makes me wonder if it’s current young user base is sustainable or if Roblox depends on cycling generations of kids and isn’t really capable of building an older following in its current state.\n\nMoving on, there’s a thriving black market for Robux and limited cosmetic items because of the aforementioned poor on-site economy. The cosmetics catalog used to have sales for holidays like Black Friday and Memorial Day. These are no longer a thing as of the last few years, which seems like a simple enough thing to do to keep Robux flowing in the economy, but they refuse to do so. (??)\n\nSpeaking of site-wide events, celebrations like a yearly Egg Hunt, events which were dear to many users, are no more. Instead, they are replaced with corporate promotional events. These don’t yield independent games made by Roblox themselves like the Egg Hunt; instead, independent developers are “contracted” to shimmy these elements into their games. Doesn’t make for a very memorable experience, and I don’t know if the microtransactions yielded are any higher than they were for the previous events.\n\nThe search function on the website is pretty broken; for example, if you search the cosmetics catalog for “Adidas hoodie”, that can net you “ADIDAS ADIDAS ADIDAS ADIDAS” named items that may not be a hoodie or relevant to what you’re looking for at all, just something that’s spammed the tag you searched for. This has been the case for years and no attempt to remedy it is evident.\n\nRecently, user-generated content (UGC) has been introduced to the cosmetics catalog, in which approved users can upload hats and other cosmetics rather than just Roblox themselves as before. One of the only good features introduced in the last few years in my opinion, but as a result, Roblox itself has essentially stopped making any cosmetics themselves.\n\nBasically, with the content creation almost exclusively done by independent users and developers, the site now runs itself. As a result, it feels the platform has been stagnating creatively for years. Beyond updating the game client, it’s not really clear what (if anything) Roblox does behind the scenes to promote growth. There’s a lot of very simple improvements and features that could be introduced to satisfy the user base and maintain the appeal to kids and the older audience, but Roblox seems to be reluctant to do so for some reason. For instance, it’s weird that users are begging for on-site sales, which are such a cornerstone of almost any business, or site events, which should be essential as a social game platform. This makes me worry they are forgetting that their user base made them successful in the first place. In short, it doesn’t seem to have the exponential growth it saw from 2007 to the early/mid-2010s, which is worrisome as the platform as a whole is not doing a good job at creating a loyal user base.\n\nAll that being said, this is my perspective of a player. I hope a developer can chime in with their thoughts on the pros and cons of developing on Roblox, what their Robux income looks like, and how that translates into real-world currency.\n\n**EDIT:** This post has blown up way past the point I expected it to. As such, I feel it's necessary to address some of the points that myself and others have brought up in this thread. Going forward, this will be more of a financial approach that can tie in with my product/customer analysis.\n\n[Here is Roblox's S-1 form.](https://www.sec.gov/Archives/edgar/data/1315098/000119312520298230/d87104ds1.htm) I want to specifically focus on a few sections:\n\n>***We have a history of net losses and we may not be able to achieve or maintain profitability in the future.***  \n>  \n>We have incurred net losses since our inception, and we expect to continue to incur net losses in the near future. We incurred net losses of $97.2 million, $86.0 million, and $203.2 million for the years ended December 31, 2018 and 2019, and the nine months ended September 30, 2020, respectively. As of September 30, 2020, we had an accumulated deficit of $484.0 million. We also expect our operating expenses to increase significantly in future periods, and **if our** **DAU growth does not increase to offset these anticipated increases in our operating expenses, our business, results of operations, and financial condition will be harmed, and we may not be able to achieve or maintain profitability**. We expect our costs and expenses to increase in future periods as we intend to continue to make significant investments to grow our business. These efforts may be more costly than we expect and may not result in increased revenue or growth of our business. In addition to the expected costs to grow our business, we also expect to incur significant additional legal, accounting, and other expenses as a newly public company. If we fail to increase our revenue to sufficiently offset the increases in our operating expenses, we will not be able to achieve or maintain profitability in the future.\n\nRoblox is currently relying upon their Daily Active Users (DAU) to increase past their record all-time high to achieve profitability after a history of net loss. This record was achieved mostly likely due to the current pandemic keeping kids locked inside. They touch on this here:\n\n>***We have experienced rapid growth in recent periods, and our recent growth rates may not be indicative of our future growth or the growth of our market.***  \n>  \n>We have experienced rapid growth in the three months ended June 30, 2020, September 30, 2020 and for a portion of the three months ended March 31, 2020, due in part to the COVID-19 pandemic given our users have been online more as a result of global COVID-19 shelter-in-place policies. For example, our bookings increased 171% from the nine-months ended September 30, 2019 to the nine months ended September 30, 2020. We do not expect these activity levels to be sustained, and in future periods we expect growth rates for our revenue to decline, and we may not experience any growth in bookings or our user base during periods where we are comparing against COVID-19 impacted periods (i.e. the three months ended March 31, 2020, June 30, 2020, and September 30, 2020). Our historical revenue, bookings and user base growth should not be considered indicative of our future performance. We believe our overall acceptance, revenue growth and increases in bookings depend on a number of factors, including, but not limited to, our ability to:  \n>  \n>• **expand the number of developers, creators, and users on our platform;**  \n>  \n>• **provide excellent customer experience and customer support for our developers, creators, and users;**  \n>  \n>**• increase global awareness of our brand.**\n\nThe bolded bullet points here tie in directly with points I have mentioned in my original post, along with this section here:\n\n>***We depend on our developers to create digital content that our users find compelling, and our business will suffer if we are unable to entertain our users, improve the experience of our users, or properly incentivize our developers and creators to develop content.***  \n>  \n>Our platform enables our developers to create experiences and virtual items, which we refer to as user generated content. Our platform relies on our developers to create experiences and virtual items on our platform for our users to acquire and/or use. Our users interact with these experiences, which are largely **free** to engage with.\n\nLargely free to engage with - this echoes my previous sentiment in which few players are really seen spending money on this game, at least compared to the amount who don't.\n\nSo, let's conclude. Where do we stand?\n\n* [Roblox has developers bringing in millions of dollars, with one of them reportedly bringing in $50 million as of 2020.](https://preview.redd.it/vzbeykpuffj61.png?width=1308&format=png&auto=webp&s=fb544d5496049a3bd14bce8db3cad31e1896db6a)\n   * Another thing to note here that I thought was funny was the President mentioning his Roblox account being a company goal. Ambitious, or last-ditch effort at marketing?\n   * This is taken from the [2020 Roblox Developer's Conference.](https://blog.roblox.com/2020/07/rdc-2020-recap/)\n* [Roblox has an Amazon store selling merchandise and toys, the latter of which are also available in stores worldwide.](https://www.amazon.com/roblox?=&_encoding=UTF8&tag=r05d13-20&linkCode=ur2&linkId=5562fc29c05b45562a86358c198356eb&camp=1789&creative=9325&productGridPageIndex=2)\n* Roblox runs its own data centers to deliver its platform.\n   * For the nine months ended September 30, 2019, direct infrastructure costs were $58.2 million, or 13% of bookings, and grew by 66% to $96.8 million, or 8% of bookings, in the nine months ended September 30, 2020.\n      * This data is taken from the S-1 form.\n\nSo, it's clear that the company is well cemented and has elements that should signify growth, but it's still unclear why such significant investment and presence in the online video game market has not yet translated to profit. This makes it difficult for me to make a bull case for $RBLX. The DPO on March 10th is expected to be around $45. Had this offering been in the single digits or teens, I believe a great long value play could've been made. For me, $45 is a bit too rich for my blood for a company that is hinging on continued growth past the pandemic and a lot of other things going right that should have already happened in the last 16 years that they have been in business.\n\n**EDIT 2**: I feel the need to address a point brought up in [this comment chain, which is a great read and offers the developer insight I was looking for.](https://www.reddit.com/r/investing/comments/lrl4qf/thoughts_from_my_personal_experience_with_roblox/gooabb3/?context=3) A lot of Roblox's viability for future growth hinges on continuing to grow as a game engine & platform rather than just a social platform for kids that happens to have games. Here are my thoughts on that, as things stand now.\n\nFor Roblox to be taken more seriously as a game engine, like Unity or Unreal, they need to continue to rebrand and move past the image of \"kid's Lego game/Minecraft alternative\", which will consume even more capital than they're already investing, not to mention the costs of simply going public. Their VC funding last year leading to their 30M valuation is 7x bigger than the funding of the previous year. Whether that symbolizes huge future growth or dumping the company on retail investors as a backup is up to your belief in the company.\n\nThe game engine uses Lua, and it has improved a lot in the past years. [Here are some images showing what's possible.](https://preview.redd.it/s5b0bxgqkfj61.png?width=690&format=png&auto=webp&s=cc1447a41923c6ec69d9626a644d486c54c3af78) Looks great, right? Yes, but their target demographic doesn't have cutting-edge PCs that can run those graphics. From their S1:\n\n>68% of our engagement hours on the platform were from users who signed up through the Apple App Store and Google Play Store.\n\nThese kids play on tablets, not supercomputers. That being said, any game developed in Roblox needs to work with the economy of the website. Unity and Unreal don't suffer from this, because they were never a social platform for kids. Whether or not that is a limiting factor to growth depends on the games developers want to make. You must also keep in mind that whatever is developed on Roblox needs to be gobbled up by an age group that is predominantly under 13. From their S1:\n\n>For the nine months ended September 30, 2020, 54% of our users were under the age of 13.\n\nA lot of accounts could have fake birthdays, lending further to the idea of a young player base. As a result, complex games with cutting-edge industry tech isn't the cash cow here. This means that all the money invested in improving the platform might not result in tangible returns. Furthermore, the most popular games are cash grab \"simulators\" and carbon copies of games that already exist, sometimes with stolen assets. That presents a copyright problem if Roblox is to continue expanding.\n\nIf you got this far, thanks for reading, and best of luck in your future investments.",
                "title": "Thoughts from my personal experience with Roblox over the past 15 years"
            },
            {
                "created_utc": 1614035250.0,
                "num_comments": 137,
                "permalink": "/r/investing/comments/lq2ran/roblox_ipo_set_for_march_10/",
                "score": 351,
                "selftext": "Roblox DPO set for March 10\n\nRoblox DPO, which has been delayed a few times, finally coming up on March 10. Looks like will open at 41-45.  I was hoping for a little less, but still might be worth it. I think saw initial valuation at 30b? \n\nArticle from WSJ _ https://www.google.com/amp/s/www.wsj.com/amp/articles/roblox-shares-to-begin-trading-march-10-11614010874\n\nMight be a good stock, but I'm not sure if the surge in holds past the summer when kids go back to o school.   I also like any DPO that goes direct to market.\n\nEdit: DPO, not IPO",
                "title": "Roblox IPO set for March 10"
            },
            {
                "created_utc": 1614192515.0,
                "num_comments": 62,
                "permalink": "/r/stocks/comments/lrk8uv/thoughts_from_my_personal_experience_with_roblox/",
                "score": 161,
                "selftext": "You can look at their books, but I believe it’s difficult to make an informed decision about $RBLX without some experience with the website and games themselves. Here are some of my thoughts from being an active member since 2007. Feel free to ask me any questions you might have about the platform.\n\nRoblox has been available to the public since 2006; you’re not investing in a new up & coming company. It’s been around for 16 years, which is very long for an online game. That in itself is a good sign, but its potential and success is pretty cemented as of now. The lack of worldwide reach (with the majority of users being from North America) is worrisome, but there may be room for growth.\n\nThey recently reached over a billion registered users, and are currently sitting at 2.4 billion. The daily active user (DAU) count is somewhere around 30 million. Thus, the vast majority of registered users are inactive users or bots who prey on dumb kids to steal their account info via cookies. Their security and captcha, to summarize, sucks.\n\nRoblox itself is a game client, but the website houses a variety of games made by users, of varying quality. There are some real gems but some real garbage as well. The front page cycles the same popular games and not a lot of up-and-coming ones. I can imagine it would be quite difficult to break into the algorithm if you’re not already a popular developer. Some people use/pay for bots to pump up their game’s likes and user count. This is obviously against the site's TOS, but it’s difficult to get ahead unless you pour hundreds into on-site ads.\n\nYears ago, they shut down the forum, which contributed to a lot of helpful and insightful on-site discussion. They did so because they believed it was becoming difficult to moderate. Hire more moderators? That on top of the fact that the chat filter (both on-site and in-game) is becoming increasingly overbearing, it’s difficult to hold a conversation on the website, let alone form a tight-knit community. I feel a community is **essential** to the success of a social game platform like this one; right now, it feels like a soulless, barren corporate wasteland, compared to what it was before. Take a look at their [logo change](https://logos-world.net/wp-content/uploads/2020/10/Roblox-Logo-History.jpg), which summarizes the company’s new ethos well. There’s the argument that the chat filter needs to be overbearing because of the possibility of online predators - which is true - but there’s a difference between overbearing and broken. Sometimes, every second word is censored, even completely innocent ones.\n\nTheir customer support is pretty dismal. Not much else to say here, but I’ve personally dealt with it, and unless you are asking something really basic that can be answered by looking at the FAQ, they’re not much help. Just your typical outsourced copy & paste replies. When it comes to accidental moderation resulting in bans or account deletion, or account theft, they’re not very helpful. I’ve had an account made in 2010 deleted in 2016 for something I did not do (account theft; the account itself was stolen) and they were no help.\n\nYears ago as well, the “free” currency Tickets were removed, leaving the premium one, Robux. Tickets were awarded on daily login and could be used to purchase cosmetics and such. Now, join any game and almost every avatar you see is the default one because the vast majority of kids aren’t paying for the premium membership which gives you monthly Robux, nor are they paying for Robux itself.\n\nThus, parent’s wallets are the limiting factor on how much Roblox can grow, because a lot of the older base such as myself shares the same sour sentiment regarding the website as a whole. Even newer users are seen calling for the “glory days” of Roblox to come back, which is odd since they themselves did not experience those “glory days”. That being said, the general community sentiment seems that not many people are happy with the site in its current state, which makes me wonder if it’s current young user base is sustainable or if Roblox depends on cycling generations of kids and isn’t really capable of building an older following in its current state.\n\nMoving on, there’s a thriving black market for Robux and limited cosmetic items because of the aforementioned poor on-site economy. The cosmetics catalog used to have sales for holidays like Black Friday and Memorial Day. These are no longer a thing as of the last few years, which seems like a simple enough thing to do to keep Robux flowing in the economy, but they refuse to do so. (??)\n\nSpeaking of site-wide events, celebrations like a yearly Egg Hunt, events which were dear to many users, are no more. Instead, they are replaced with corporate promotional events. These don’t yield independent games made by Roblox themselves like the Egg Hunt; instead, independent developers are “contracted” to shimmy these elements into their games. Doesn’t make for a very memorable experience, and I don’t know if the microtransactions yielded are any higher than they were for the previous events.\n\nThe search function on the website is pretty broken; for example, if you search the cosmetics catalog for “Adidas hoodie”, that can net you “ADIDAS ADIDAS ADIDAS ADIDAS” named items that may not be a hoodie or relevant to what you’re looking for at all, just something that’s spammed the tag you searched for. This has been the case for years and no attempt to remedy it is evident.\n\nRecently, user-generated content (UGC) has been introduced to the cosmetics catalog, in which approved users can upload hats and other cosmetics rather than just Roblox themselves as before. One of the only good features introduced in the last few years in my opinion, but as a result, Roblox itself has essentially stopped making any cosmetics themselves.\n\nBasically, with the content creation almost exclusively done by independent users and developers, the site now runs itself. As a result, it feels the platform has been stagnating creatively for years. Beyond updating the game client, it’s not really clear what (if anything) Roblox does behind the scenes to promote growth. There’s a lot of very simple improvements and features that could be introduced to satisfy the user base and maintain the appeal to kids and the older audience, but Roblox seems to be reluctant to do so for some reason. For instance, it’s weird that users are begging for on-site sales, which are such a cornerstone of almost any business, or site events, which should be essential as a social game platform. This makes me worry they are forgetting that their user base made them successful in the first place. In short, it doesn’t seem to have the exponential growth it saw from 2007 to the early/mid-2010s, which is worrisome as the platform as a whole is not doing a good job at creating a loyal user base.\n\nAll that being said, this is my perspective of a player. I hope a developer can chime in with their thoughts on the pros and cons of developing on Roblox, what their Robux income looks like, and how that translates into real-world currency.",
                "title": "Thoughts from my personal experience with Roblox over the past 15 years"
            },
            {
                "created_utc": 1614196496.0,
                "num_comments": 29,
                "permalink": "/r/stocks/comments/lrltbv/prediction_march_10th_will_be_another_shitshow_in/",
                "score": 68,
                "selftext": "Ok guys, bear with me. Aplogies in advance if I get anything wrong. I just wanna have discussion on Roblox, where it's going, what happens and why the market could goof us retail guys again. I'm no expert. Im not financial pro. I just sit at home all day reading about stocks and learning new stuff.\n\nQuick backstory, Roblox is dropping onto the market on March 10th via DPO. A DPO is a direct public offering. It's similar to an IPO, but in simple terms, it slams onto the market, for everyone at the same time.\n\nRemember the debacle with AirBNB and DoorDash? They were IPO's, scooped up by the hedgies and big boys. When retail wanted to buy, the price was stupid high and a lot of people got the rug pulled out from them. My understanding is the prices have settled now, but that day was a huge shitshow with retail buying power seriously hindered by the volume, demand, prices and platforms of retail brokers. \n\nRoblox will be ten times worse.\n\nI'll make this next bit quick. (Edit - I lied, this next bit isn't quick but it is necessary). - \n\n**What is Roblox?**\n\nRoblox is a MONEY PRINTER. Seriously. Maybe you're not into games, or have no kids or whatever. Basically, think of it as something like minecraft. Its a computer game for kids. The characters are made up of blocks, and run around online, meeting other players, doing little games, meeting each other, performing tasks etc. I don't really know, i've never played it but watched some YT vids of people playing. In simple terms, it's good honest child friendly fun, which even adults can have a laugh with. \n\nIt runs on Console, PC and mobile. Roblox has 1600 employees dedicated to removing hate speech and offensive things. There was a link to some far right groups using Roblox. As soon as they were found out by the press, Roblox banned them outright. My understanding is that as far as online gaming goes, it's very safe and good for kids, without much toxic language or offensive things that can upset young kids. It seems Roblox take their shit seriously in respect of this. \n\n~ Let's quickly talk numbers ~\n\nFirst off, let's drop the Tsar Bomba (aka the biggest mofo nuclear bomb ever made) of figures;\n\nFrom wiki - *From February 2020 to January 2021, Roblox experienced an increase in valuation from $4 billion to $29.5 billion, an increase attributed largely to the pandemic.*\n\n**29 MOTHERFUDGING BILLION IN 11 MONTHS.**\n\nRead that last line again before we continue. \n\nNext up, lets talk players. Again, wiki;\n\n**As of August 2020, Roblox has over 164 million monthly active users, with it being played by over half of all children aged under 16 in the United States**\n\n164 MILLION.  Let me put that into perspective. I want you to imagine every single person in Argentina, Ghana, Saudia Arabia, Cuba, Sweden, Israel, Hong Kong, Denmark, Norway, Belgium and Switzerland. That's how many people are active on RBLX each month. Mental. Now, obviously I could have just said 50% of the USA but that's boring.\n\nNow don't get me wrong, its not up to the heights of things like PUBG, Fortnite or Runescape, but it's 30% more popular than World of Warcraft and 50% more popular than GTA. \nOh, and RBLX is *free to play*. However, it generates its money from \"Robux\". Basically, you can pay for these Robux as a form of currency, which you can then spend on special abilities in game. If I had $1 every time I read on Reddit, as user saying \"all my kid asks for at Christmas and birthdays is these damn Robux coin things\", then i'd have enough $$$ to take on SpaceX. It seems like kids just lap this shit up all the time, and parents seem fairly happy to pay for it because it's a fun game with no toxic assholes. It certainly has less of the agressive, competitive stigma and negative traits that has been attached to games like Fortnite. \n\nAnyway, go and do you own DD on this. I'm sure there are some negatives to be found, so go take a look.  All you really need to know is that RBLX is a motherfakin JUGGERNAUGHT of online gaming. In 2020 it had a revenue of *$2.2 billion* across all platforms. \n\n**\"Hey Electricpowow what is the point of all this crap about robollocks or something?**\n\nOk listen up and lets get to the point; this is my own sheer prediciton and that's it.... But, RBLX is going to be the MOTHER of all meme stonks. Seriously. It's a silly game with huge values and various other subreddits will find it hilarious to send Roblox to the moon. Mainly because of how simple it is. It's just got the whole aire of a meme stock about it. Even those that want to make it a meme stock believe deep down that it actually is a solid money maker at heart. The fact it's a silly kids video game makes it even sweeter. We know what the retail power is when it comes to video game related stock matters....\n\nSecondly, ignoring people who post rocket emojis and apes, this kinda stuff is gonna be loved by boomers. What do boomers have? Kids. What do kids talk about all day long? Roblox. These are the same boomers who invest in Apple because their 14 year old never shuts up about how amazing the next iPhone will be. They'll be doing the same with their small kids on the Blox. I've even seen some redditors saying they'll be buying Roblox as a long term investement then gift it to their kids in 14 years time for their 18th, like it's some sort of damned Roblox based trust fund or some crazy shit. Can you imagine Cramer trying to explain League of Legends to his boomer audience? Well he doesn't need to explain Roblox because the boomer's kids talk about it all day. \n\nNow, the whole point of this is that.... EVERYONE is gonna want a slice of the Roblox pie. Even more so, that its coming out as an DPO. That means you and Papa Musk and horrible nasty Uncle Melvin will be able to buy RBLX at the same time. My understanding is they usually list at about midday. \n\nNow, why is Blox going to be a DPO and not an IPO? **They actually wanted to list as an IPO several months ago**. Wait, sorry that's not right. They wanted to list as an IPO **TWICE** and pulled out. Why? Well, one reason is that their accounting needed a closer examination, but the primary reason was because they saw the utter shitshow that was AirBNB. They saw AirBNB moon all the way past Jupiter and in no time at all, it nailed back down to earth with more power then a Michael Jordan slam dunk. \n\nIn short, Roblox guys realised that IPO's are quite unstable with big companies, so they do DPO. I also think that a DPO somehow lets current investors safely leave their positions without getting burned or something, but im unsure on this. \n\nIt also means that the DPO price will be much higher than an IPO starting price. This in turn brings some stability. My understanding is the expected IPO price was going to be about $5 per share, whereas the DPO price will be around $45/s. 45 Dollars a share is still pretty damn cheap. \n\nNow, consider that Andreessen Horowitz are one of their big investors. Ok, so who the hell is Andrew Hogwartz? That shit don't matter, all you need to know is that their track record of investment in young companies is as follows -\n\nFacebook, Groupon, Skype, Lyft, Occulus VR, GitHub, BuzzFeed and loads of others. Oh and they also dumped 800 million into Crypto in the last 5 years. What's the theme here? Tech based software stocks that balloon in value. That's what. I think its fair to say, that when it comes to tech and software, Andreas Hobofizz knows exactly what they are doing. And they've dumped their money and reputation into the Blox. \n\nNow, with all this said what does this mean? It means everyone will want a slice of the RBLX cake. Boomers who's kids never shut up about it. People who like tech stocks. Gamers. Meme train riders. Investement funds and big hedgies. Everyone can see that RBLX is a money machine. And in fairness, $45/s is modest when you dive deep into the numbers. \n\nTakeTwo interactive (Grand Theft Auto) is $186/s. Activision is at $95/s. Tencent (who do Leage of Legends, another HUGE multiplayer online game) is at $88/s. Electronic arts, $137/s. \n\nYadadayablah you get the idea. The only real big name I can find which is near the RBLX price is Nintendo at $78/s. (This is for another day but I think Nintendo is massively undervalued - Maybe thats why Cathy and her ARKK have been constantly buying it of late?)\n\nSo, what is my whole point of this? If you got this far, good work, because i'm a moron and my hands hurt from all this typing but I like you guys so ima carry on...\n\nThing is, on March 10th. Every man and his dog is gonna want to throw some money at the Blox. And what happens when everyone wants to buy? Our shitty retail brokers... break. They have 'outages', they are slow, they don't process orders quickly etc etc. Maybe this is because of the huge volume and demand. Tin foil hat wearers will say it's all orcestrated, to freeze out retail while the hedgies get into the Blox at 45/s and we can't get in until 90/s, just like what happened with AirBNB and DoorDash. \n\nNote this, in all the reading i've done so far about RBLX, I've not seen a single article that is offering negative sentiment about it. I saw a fair amount of negative sentiment about the other two in the buildup, but especially DoorDash. \n\nSo, obviously you can set your limits, but this won't work if the price is zooming around and the volume is being gobbled up. Oh yeah, volume. 199 million shares will be up for grabs. \n\nAirBNB put out 50 million. I think DD put out about 35 million. So... RBLX is putting out a lot of shares... But I also think it's gonna have much more interest than the companies I just mentioned...\n\nI don't know what the answer or solution is here if you do wanna buy it. I personally think (in the short term), it'll be bigger than a certain recent StopGame share in terms of interest. I honestly believe everyone will want some of this, and as retail investors, we're likely gonna get boned. *again*. \n\nNow this also extends to people who might not care about RBLX. If you shitty broker goes down, or lags, or won't connect because everyone wants some blox, then good luck selling that pennystock you've been sat on for a while when March 10th is the perfect time to sell. It *might* have a knock on effect on your ability to perform other trades so please bear it in mind. You spot an amazing buy on American Airlines but unlucky bro, you cant because your shitty phone based broker has another 'outage' because everyone wants to buy rublix or some shit. Maybe people could set up a couple of brokers to give them the best chance of a buy? Remember some brokers want proof of earnings and stuff so consider this sooner rather than later if you want in on this partay. \n\nFinally; Ever seen or heard someone online say *\"oof\"*? Its a Roblox meme that's been around for years. Its the noise a character makes when it gets hurt or falls over. Its another meme version of 'RIP'.  I hope March 10th isnt a big **oof** for retail.\n\nAnd that's it guys and girls. I'd love to hear thoughts on this. At least give me the dignity of telling me my DD and entire post sucks. This will justify the 25 minutes I spent typing this out. \n\nMy position? I'm unsure at the moment. I'm 50/50 between going total YOLO on Roblox on the 10th and either sitting out totally, or just trying to open a small position to see if I'm right.",
                "title": "Prediction- March 10th will be another shitshow in the market. A (brief) $RBLX DD. (and maybe numerous issues with your other trades/broker)"
            }
        ]
    }
}